/*
SQLyog Ultimate v12.4.1 (64 bit)
MySQL - 5.7.18-log : Database - dataset-annotation
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`dataset-annotation` /*!40100 DEFAULT CHARACTER SET utf8mb4 */;

USE `dataset-annotation`;

/*Table structure for table `auth_group` */

DROP TABLE IF EXISTS `auth_group`;

CREATE TABLE `auth_group` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `auth_code` varchar(32) NOT NULL COMMENT '权限code',
  `description` varchar(255) DEFAULT NULL COMMENT '描述',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人id',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) DEFAULT b'0' COMMENT '删除标记 0正常，1已删除',
  PRIMARY KEY (`id`),
  KEY `auth_index_auth_code` (`auth_code`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COMMENT='权限组表';

/*Data for the table `auth_group` */

insert  into `auth_group`(`id`,`auth_code`,`description`,`create_user_id`,`update_user_id`,`create_time`,`update_time`,`deleted`) values 
(1,'admin权限组','默认全部操作权限',1,1,'2023-04-14 15:44:51','2023-04-26 11:19:58','\0'),
(2,'普通用户',NULL,1,1,'2023-04-23 17:21:18','2023-04-26 10:29:25','\0');

/*Table structure for table `auth_permission` */

DROP TABLE IF EXISTS `auth_permission`;

CREATE TABLE `auth_permission` (
  `auth_id` bigint(20) NOT NULL,
  `permission_id` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='权限组-权限关联表';

/*Data for the table `auth_permission` */

insert  into `auth_permission`(`auth_id`,`permission_id`) values 
(2,106),
(2,111),
(1,5),
(1,6),
(1,7),
(1,8),
(1,9),
(1,10),
(1,11),
(1,12),
(1,13),
(1,14),
(1,15),
(1,16),
(1,17),
(1,18),
(1,19),
(1,20),
(1,21),
(1,22),
(1,23),
(1,24),
(1,25),
(1,26),
(1,27),
(1,28),
(1,29),
(1,30),
(1,31),
(1,32),
(1,33),
(1,34),
(1,35),
(1,36),
(1,37),
(1,38),
(1,39),
(1,40),
(1,41),
(1,106),
(1,110),
(1,111);

/*Table structure for table `auto_label_model_service` */

DROP TABLE IF EXISTS `auto_label_model_service`;

CREATE TABLE `auto_label_model_service` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `model_type` smallint(6) NOT NULL COMMENT '模型类别',
  `remark` varchar(255) DEFAULT NULL COMMENT '服务描述 ',
  `model_branch_id` bigint(20) DEFAULT NULL COMMENT '模型版本ID',
  `model_parent_id` bigint(20) DEFAULT NULL COMMENT '模型版本父ID',
  `image_id` bigint(20) NOT NULL COMMENT '镜像ID',
  `image_name` varchar(64) NOT NULL COMMENT '镜像名称',
  `algorithm_id` bigint(20) NOT NULL COMMENT '算法ID',
  `status` smallint(6) NOT NULL COMMENT '状态\n101-启动中\n102-运行中\n103-启动失败\n104-停止中\n105-已停止',
  `resources_pool_type` smallint(6) NOT NULL DEFAULT '0' COMMENT '节点类型\n0-cpu\n1-gpu',
  `resources_pool_specs` varchar(512) NOT NULL COMMENT '节点规格',
  `instance_num` smallint(6) NOT NULL COMMENT '服务数量',
  `deleted` bit(1) NOT NULL DEFAULT b'0' COMMENT '数据集版本删除标记0正常，1已删除',
  `create_user_id` bigint(20) NOT NULL COMMENT '创建人',
  `create_time` datetime NOT NULL COMMENT '创建时间',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人',
  `update_time` datetime DEFAULT NULL COMMENT '修改时间',
  `name` varchar(32) DEFAULT NULL COMMENT '服务名称',
  PRIMARY KEY (`id`),
  UNIQUE KEY `unique_name` (`name`) USING BTREE COMMENT '模型服务名称不重复'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='标注服务';

/*Data for the table `auto_label_model_service` */

/*Table structure for table `data_dataset` */

DROP TABLE IF EXISTS `data_dataset`;

CREATE TABLE `data_dataset` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `remark` varchar(255) DEFAULT NULL,
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '类型 0: private 私有数据,  1:team  团队数据  2:public 公开数据',
  `team_id` bigint(20) DEFAULT NULL,
  `uri` varchar(255) DEFAULT '' COMMENT '数据集存储位置',
  `create_user_id` bigint(20) DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_user_id` bigint(20) DEFAULT NULL,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) DEFAULT NULL,
  `data_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '数据类型:0图片，1视频，2文本',
  `annotate_type` smallint(6) NOT NULL DEFAULT '0' COMMENT '标注类型：2分类,1目标检测,5目标跟踪',
  `labels` varchar(255) NOT NULL DEFAULT '' COMMENT '标签集合，以逗号分隔',
  `status` int(11) NOT NULL DEFAULT '0' COMMENT '101:未标注  102:手动标注中  103:自动标注中  104:自动标注完成  105:标注完成  201:目标跟踪中  202:目标跟踪完成  203:目标跟踪失败  301:未采样  302:采样中  303:采样失败  401:增强中  402:导入中',
  `current_version_name` varchar(16) DEFAULT NULL COMMENT '当前版本号',
  `is_import` tinyint(1) DEFAULT '0' COMMENT '是否用户导入',
  `archive_url` varchar(255) DEFAULT NULL COMMENT '用户导入数据集压缩包地址',
  `decompress_state` tinyint(4) DEFAULT '0' COMMENT '解压状态: 0未解压 1解压中 2解压完成 3解压失败',
  `decompress_fail_reason` varchar(255) DEFAULT NULL COMMENT '解压失败原因',
  `is_top` tinyint(1) DEFAULT NULL COMMENT '是否为置顶',
  `origin_user_id` bigint(20) DEFAULT NULL COMMENT '资源拥有人id',
  `label_group_id` bigint(20) DEFAULT NULL COMMENT '标签组ID',
  `source_id` bigint(20) DEFAULT NULL COMMENT '数据集源ID',
  `template_type` int(11) DEFAULT '101',
  `module` smallint(6) DEFAULT NULL COMMENT '模块 1-普通数据集 2-重组训练-单任务 3-重组训练-多任务',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8mb4 COMMENT='数据集管理';

/*Data for the table `data_dataset` */

/*Table structure for table `data_dataset_label` */

DROP TABLE IF EXISTS `data_dataset_label`;

CREATE TABLE `data_dataset_label` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `dataset_id` bigint(20) unsigned NOT NULL,
  `label_id` bigint(20) unsigned NOT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  `deleted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '删除(0正常，1已删除)',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人id',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `dataset_id` (`dataset_id`,`label_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1425 DEFAULT CHARSET=utf8mb4 COMMENT='数据集标签';

/*Data for the table `data_dataset_label` */

/*Table structure for table `data_dataset_version` */

DROP TABLE IF EXISTS `data_dataset_version`;

CREATE TABLE `data_dataset_version` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `dataset_id` bigint(20) DEFAULT NULL COMMENT '数据集ID',
  `team_id` bigint(20) DEFAULT NULL COMMENT '团队ID',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人',
  `create_time` datetime NOT NULL COMMENT '创建时间',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人',
  `update_time` datetime DEFAULT NULL COMMENT '修改时间',
  `deleted` bit(1) NOT NULL DEFAULT b'0' COMMENT '数据集版本删除标记0正常，1已删除',
  `version_name` varchar(8) NOT NULL COMMENT '版本号',
  `version_note` varchar(50) NOT NULL COMMENT '版本说明',
  `version_source` varchar(32) DEFAULT NULL COMMENT '来源版本号',
  `version_url` varchar(255) DEFAULT NULL COMMENT '版本信息存储url',
  `data_conversion` int(11) NOT NULL DEFAULT '0' COMMENT '数据转换；0：未复制；1：已复制;2:转换完成,3:转换失败',
  `origin_user_id` bigint(20) DEFAULT NULL COMMENT '资源用有人ID',
  `of_record` tinyint(1) DEFAULT '0' COMMENT '是否生成ofRecord文件',
  `format` char(32) DEFAULT 'TS' COMMENT '格式  TS COCO YOLO',
  `contain_origin` bit(1) NOT NULL DEFAULT b'1' COMMENT '是否包含源文件',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `unique_version` (`dataset_id`,`version_name`) COMMENT '数据集版本号唯一'
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb4 COMMENT='数据集版本表';

/*Data for the table `data_dataset_version` */

/*Table structure for table `data_dataset_version_file` */

DROP TABLE IF EXISTS `data_dataset_version_file`;

CREATE TABLE `data_dataset_version_file` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `dataset_id` bigint(20) DEFAULT NULL COMMENT '数据集ID',
  `version_name` varchar(8) DEFAULT NULL COMMENT '数据集版本',
  `file_id` bigint(20) DEFAULT NULL COMMENT '文件ID',
  `status` tinyint(1) NOT NULL DEFAULT '2' COMMENT '状态 0: 新增 1:删除 2:正常',
  `annotation_status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '101:未标注  102:手动标注中  103:自动标注完成  104:标注完成  105:标注未识别  201:目标跟踪完成',
  `backup_status` tinyint(3) unsigned DEFAULT '0' COMMENT '数据集状态备份,版本切换使用',
  `changed` bit(1) DEFAULT b'0' COMMENT '0 - 未改变,1 - 改变',
  `file_name` varchar(255) DEFAULT '' COMMENT '文件名称',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `select_status` (`dataset_id`,`version_name`) USING BTREE,
  KEY `dataset_id_annotation_status` (`dataset_id`,`annotation_status`,`version_name`) USING BTREE,
  KEY `select_file` (`dataset_id`,`status`,`annotation_status`,`version_name`,`file_id`),
  KEY `file_state_annotation_finished` (`dataset_id`,`file_id`,`version_name`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='数据集版本文件关系表';

/*Data for the table `data_dataset_version_file` */

/*Table structure for table `data_dataset_version_file_1` */

DROP TABLE IF EXISTS `data_dataset_version_file_1`;

CREATE TABLE `data_dataset_version_file_1` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `dataset_id` bigint(20) DEFAULT NULL COMMENT '数据集ID',
  `version_name` varchar(8) DEFAULT NULL COMMENT '数据集版本',
  `file_id` bigint(20) DEFAULT NULL COMMENT '文件ID',
  `status` tinyint(1) NOT NULL DEFAULT '2' COMMENT '状态 0: 新增 1:删除 2:正常',
  `annotation_status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '101:未标注  102:手动标注中  103:自动标注完成  104:标注完成  105:标注未识别  201:目标跟踪完成',
  `backup_status` tinyint(3) unsigned DEFAULT '0' COMMENT '数据集状态备份,版本切换使用',
  `changed` bit(1) DEFAULT b'0' COMMENT '0 - 未改变,1 - 改变',
  `file_name` varchar(255) DEFAULT '' COMMENT '文件名称',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `select_status` (`dataset_id`,`version_name`) USING BTREE,
  KEY `dataset_id_annotation_status` (`dataset_id`,`annotation_status`,`version_name`) USING BTREE,
  KEY `select_file` (`dataset_id`,`status`,`annotation_status`,`version_name`,`file_id`),
  KEY `file_state_annotation_finished` (`dataset_id`,`file_id`,`version_name`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=15002 DEFAULT CHARSET=utf8mb4 COMMENT='数据集版本文件关系表';

/*Data for the table `data_dataset_version_file_1` */

/*Table structure for table `data_file` */

DROP TABLE IF EXISTS `data_file`;

CREATE TABLE `data_file` (
  `id` bigint(20) unsigned zerofill NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `name` varchar(255) NOT NULL DEFAULT '' COMMENT '文件名',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '状态:0-未标注，1-标注中，2-自动标注完成，3-已标注完成,4-目标追踪完成',
  `dataset_id` bigint(20) DEFAULT NULL COMMENT '数据集id',
  `url` varchar(255) NOT NULL DEFAULT '' COMMENT '资源访问路径',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '更新用户ID',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `deleted` bit(1) NOT NULL DEFAULT b'0' COMMENT '0正常，1已删除',
  `file_type` tinyint(4) DEFAULT '0' COMMENT '文件类型  0-图片,1-视频',
  `pid` bigint(20) DEFAULT '0' COMMENT '父文件id',
  `frame_interval` int(11) DEFAULT '0' COMMENT '帧间隔',
  `enhance_type` smallint(6) DEFAULT NULL COMMENT '增强类型',
  `width` int(11) DEFAULT NULL COMMENT '图片宽',
  `height` int(11) DEFAULT NULL COMMENT '图片高',
  `origin_user_id` bigint(20) DEFAULT NULL COMMENT '资源拥有者ID',
  `es_transport` int(11) DEFAULT '0' COMMENT '是否上传至es',
  `exclude_header` smallint(6) NOT NULL DEFAULT '1' COMMENT 'table数据导入时，是否排除文件头',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `name_uniq` (`name`,`dataset_id`,`deleted`) USING BTREE,
  KEY `deleted` (`deleted`) USING BTREE,
  KEY `dataset_upt_time` (`dataset_id`,`update_time`) USING BTREE,
  KEY `uuid` (`url`,`deleted`) USING BTREE,
  KEY `status` (`dataset_id`,`status`,`deleted`) USING BTREE,
  KEY `es_transport` (`es_transport`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='文件信息';

/*Data for the table `data_file` */

/*Table structure for table `data_file_1` */

DROP TABLE IF EXISTS `data_file_1`;

CREATE TABLE `data_file_1` (
  `id` bigint(20) unsigned zerofill NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `name` varchar(255) NOT NULL DEFAULT '' COMMENT '文件名',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '状态:0-未标注，1-标注中，2-自动标注完成，3-已标注完成,4-目标追踪完成',
  `dataset_id` bigint(20) DEFAULT NULL COMMENT '数据集id',
  `url` varchar(255) NOT NULL DEFAULT '' COMMENT '资源访问路径',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '更新用户ID',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `deleted` bit(1) NOT NULL DEFAULT b'0' COMMENT '0正常，1已删除',
  `file_type` tinyint(4) DEFAULT '0' COMMENT '文件类型  0-图片,1-视频',
  `pid` bigint(20) DEFAULT '0' COMMENT '父文件id',
  `frame_interval` int(11) DEFAULT '0' COMMENT '帧间隔',
  `enhance_type` smallint(6) DEFAULT NULL COMMENT '增强类型',
  `width` int(11) DEFAULT NULL COMMENT '图片宽',
  `height` int(11) DEFAULT NULL COMMENT '图片高',
  `origin_user_id` bigint(20) DEFAULT NULL COMMENT '资源拥有者ID',
  `es_transport` int(11) DEFAULT '0' COMMENT '是否上传至es',
  `exclude_header` smallint(6) NOT NULL DEFAULT '1' COMMENT 'table数据导入时，是否排除文件头',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `name_uniq` (`name`,`dataset_id`,`deleted`) USING BTREE,
  KEY `deleted` (`deleted`) USING BTREE,
  KEY `dataset_upt_time` (`dataset_id`,`update_time`) USING BTREE,
  KEY `uuid` (`url`,`deleted`) USING BTREE,
  KEY `status` (`dataset_id`,`status`,`deleted`) USING BTREE,
  KEY `es_transport` (`es_transport`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=20001 DEFAULT CHARSET=utf8mb4 COMMENT='文件信息';

/*Data for the table `data_file_1` */

/*Table structure for table `data_file_annotation` */

DROP TABLE IF EXISTS `data_file_annotation`;

CREATE TABLE `data_file_annotation` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `dataset_id` bigint(20) NOT NULL COMMENT '数据集ID',
  `label_id` bigint(20) NOT NULL COMMENT '标签ID',
  `version_file_id` bigint(20) NOT NULL COMMENT '版本文件ID',
  `prediction` double DEFAULT '0' COMMENT '预测值',
  `create_user_id` bigint(20) DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_user_id` bigint(20) DEFAULT NULL,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) NOT NULL DEFAULT b'0',
  `file_name` varchar(255) DEFAULT NULL COMMENT '文件名称',
  `status` tinyint(1) DEFAULT '0' COMMENT '状态 0: 新增 1:删除 2:正常',
  `invariable` tinyint(1) DEFAULT '0' COMMENT '是否为版本标注信息0：否 1：是',
  PRIMARY KEY (`id`),
  KEY `version_file_index` (`version_file_id`) USING BTREE,
  KEY `label_dataset_id_index` (`label_id`,`dataset_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='数据集文件标注表';

/*Data for the table `data_file_annotation` */

/*Table structure for table `data_file_annotation_1` */

DROP TABLE IF EXISTS `data_file_annotation_1`;

CREATE TABLE `data_file_annotation_1` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `dataset_id` bigint(20) NOT NULL COMMENT '数据集ID',
  `label_id` bigint(20) NOT NULL COMMENT '标签ID',
  `version_file_id` bigint(20) NOT NULL COMMENT '版本文件ID',
  `prediction` double DEFAULT '0' COMMENT '预测值',
  `create_user_id` bigint(20) DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_user_id` bigint(20) DEFAULT NULL,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) NOT NULL DEFAULT b'0',
  `file_name` varchar(255) DEFAULT NULL COMMENT '文件名称',
  `status` tinyint(1) DEFAULT '0' COMMENT '状态 0: 新增 1:删除 2:正常',
  `invariable` tinyint(1) DEFAULT '0' COMMENT '是否为版本标注信息0：否 1：是',
  PRIMARY KEY (`id`),
  KEY `version_file_index` (`version_file_id`) USING BTREE,
  KEY `label_dataset_id_index` (`label_id`,`dataset_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=35002 DEFAULT CHARSET=utf8mb4 COMMENT='数据集文件标注表';

/*Data for the table `data_file_annotation_1` */

/*Table structure for table `data_group_label` */

DROP TABLE IF EXISTS `data_group_label`;

CREATE TABLE `data_group_label` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `label_id` bigint(20) DEFAULT NULL COMMENT '标签Id',
  `label_group_id` bigint(20) DEFAULT NULL COMMENT '标签组Id',
  `create_user_id` bigint(20) DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_user_id` bigint(20) DEFAULT NULL,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) NOT NULL DEFAULT b'0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1090 DEFAULT CHARSET=utf8mb4 COMMENT='标签组标签中间表';

/*Data for the table `data_group_label` */

insert  into `data_group_label`(`id`,`label_id`,`label_group_id`,`create_user_id`,`create_time`,`update_user_id`,`update_time`,`deleted`) values 
(1,81,1,1,'2023-04-14 15:45:41',1,'2023-04-14 15:45:41','\0'),
(2,82,1,1,'2023-04-14 15:45:41',1,'2023-04-14 15:45:41','\0'),
(3,83,1,1,'2023-04-14 15:45:41',1,'2023-04-14 15:45:41','\0'),
(4,84,1,1,'2023-04-14 15:45:41',1,'2023-04-14 15:45:41','\0'),
(5,85,1,1,'2023-04-14 15:45:41',1,'2023-04-14 15:45:41','\0'),
(6,86,1,1,'2023-04-14 15:45:41',1,'2023-04-14 15:45:41','\0'),
(7,87,1,1,'2023-04-14 15:45:41',1,'2023-04-14 15:45:41','\0'),
(8,88,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(9,89,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(10,90,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(11,91,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(12,92,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(13,93,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(14,94,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(15,95,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(16,96,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(17,97,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(18,98,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(19,99,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(20,100,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(21,101,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(22,102,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(23,103,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(24,104,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(25,105,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(26,106,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(27,107,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(28,108,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(29,109,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(30,110,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(31,111,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(32,112,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(33,113,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(34,114,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(35,115,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(36,116,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(37,117,1,1,'2023-04-14 15:45:42',1,'2023-04-14 15:45:42','\0'),
(38,118,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(39,119,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(40,120,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(41,121,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(42,122,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(43,123,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(44,124,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(45,125,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(46,126,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(47,127,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(48,128,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(49,129,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(50,130,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(51,131,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(52,132,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(53,133,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(54,134,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(55,135,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(56,136,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(57,137,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(58,138,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(59,139,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(60,140,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(61,141,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(62,142,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(63,143,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(64,144,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(65,145,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(66,146,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(67,147,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(68,148,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(69,149,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(70,150,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(71,151,1,1,'2023-04-14 15:45:43',1,'2023-04-14 15:45:43','\0'),
(72,152,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(73,153,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(74,154,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(75,155,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(76,156,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(77,157,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(78,158,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(79,159,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(80,160,1,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(81,161,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(82,162,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(83,163,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(84,164,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(85,165,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(86,166,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(87,167,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(88,168,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(89,169,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(90,170,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(91,171,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(92,172,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(93,173,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(94,174,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(95,175,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(96,176,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(97,177,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(98,178,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(99,179,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(100,180,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(101,181,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(102,182,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(103,183,2,1,'2023-04-14 15:45:44',1,'2023-04-14 15:45:44','\0'),
(104,184,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(105,185,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(106,186,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(107,187,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(108,188,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(109,189,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(110,190,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(111,191,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(112,192,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(113,193,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(114,194,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(115,195,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(116,196,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(117,197,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(118,198,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(119,199,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(120,200,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(121,201,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(122,202,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(123,203,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(124,204,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(125,205,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(126,206,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(127,207,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(128,208,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(129,209,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(130,210,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(131,211,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(132,212,2,1,'2023-04-14 15:45:45',1,'2023-04-14 15:45:45','\0'),
(133,213,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(134,214,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(135,215,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(136,216,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(137,217,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(138,218,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(139,219,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(140,220,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(141,221,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(142,222,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(143,223,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(144,224,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(145,225,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(146,226,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(147,227,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(148,228,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(149,229,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(150,230,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(151,231,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(152,232,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(153,233,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(154,234,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(155,235,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(156,236,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(157,237,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(158,238,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(159,239,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(160,240,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(161,241,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(162,242,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(163,243,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(164,244,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(165,245,2,1,'2023-04-14 15:45:46',1,'2023-04-14 15:45:46','\0'),
(166,246,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(167,247,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(168,248,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(169,249,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(170,250,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(171,251,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(172,252,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(173,253,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(174,254,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(175,255,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(176,256,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(177,257,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(178,258,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(179,259,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(180,260,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(181,261,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(182,262,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(183,263,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(184,264,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(185,265,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(186,266,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(187,267,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(188,268,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(189,269,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(190,270,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(191,271,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(192,272,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(193,273,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(194,274,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(195,275,2,1,'2023-04-14 15:45:47',1,'2023-04-14 15:45:47','\0'),
(196,276,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(197,277,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(198,278,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(199,279,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(200,280,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(201,281,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(202,282,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(203,283,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(204,284,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(205,285,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(206,286,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(207,287,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(208,288,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(209,289,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(210,290,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(211,291,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(212,292,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(213,293,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(214,294,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(215,295,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(216,296,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(217,297,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(218,298,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(219,299,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(220,300,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(221,301,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(222,302,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(223,303,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(224,304,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(225,305,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(226,306,2,1,'2023-04-14 15:45:48',1,'2023-04-14 15:45:48','\0'),
(227,307,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(228,308,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(229,309,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(230,310,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(231,311,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(232,312,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(233,313,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(234,314,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(235,315,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(236,316,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(237,317,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(238,318,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(239,319,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(240,320,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(241,321,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(242,322,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(243,323,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(244,324,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(245,325,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(246,326,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(247,327,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(248,328,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(249,329,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(250,330,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(251,331,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(252,332,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(253,333,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(254,334,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(255,335,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(256,336,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(257,337,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(258,338,2,1,'2023-04-14 15:45:49',1,'2023-04-14 15:45:49','\0'),
(259,339,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(260,340,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(261,341,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(262,342,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(263,343,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(264,344,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(265,345,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(266,346,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(267,347,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(268,348,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(269,349,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(270,350,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(271,351,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(272,352,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(273,353,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(274,354,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(275,355,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(276,356,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(277,357,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(278,358,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(279,359,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(280,360,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(281,361,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(282,362,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(283,363,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(284,364,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(285,365,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(286,366,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(287,367,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(288,368,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(289,369,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(290,370,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(291,371,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(292,372,2,1,'2023-04-14 15:45:50',1,'2023-04-14 15:45:50','\0'),
(293,373,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(294,374,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(295,375,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(296,376,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(297,377,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(298,378,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(299,379,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(300,380,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(301,381,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(302,382,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(303,383,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(304,384,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(305,385,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(306,386,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(307,387,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(308,388,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(309,389,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(310,390,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(311,391,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(312,392,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(313,393,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(314,394,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(315,395,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(316,396,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(317,397,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(318,398,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(319,399,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(320,400,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(321,401,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(322,402,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(323,403,2,1,'2023-04-14 15:45:51',1,'2023-04-14 15:45:51','\0'),
(324,404,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(325,405,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(326,406,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(327,407,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(328,408,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(329,409,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(330,410,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(331,411,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(332,412,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(333,413,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(334,414,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(335,415,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(336,416,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(337,417,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(338,418,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(339,419,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(340,420,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(341,421,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(342,422,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(343,423,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(344,424,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(345,425,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(346,426,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(347,427,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(348,428,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(349,429,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(350,430,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(351,431,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(352,432,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(353,433,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(354,434,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(355,435,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(356,436,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(357,437,2,1,'2023-04-14 15:45:52',1,'2023-04-14 15:45:52','\0'),
(358,438,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(359,439,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(360,440,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(361,441,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(362,442,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(363,443,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(364,444,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(365,445,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(366,446,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(367,447,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(368,448,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(369,449,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(370,450,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(371,451,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(372,452,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(373,453,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(374,454,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(375,455,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(376,456,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(377,457,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(378,458,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(379,459,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(380,460,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(381,461,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(382,462,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(383,463,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(384,464,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(385,465,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(386,466,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(387,467,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(388,468,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(389,469,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(390,470,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(391,471,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(392,472,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(393,473,2,1,'2023-04-14 15:45:53',1,'2023-04-14 15:45:53','\0'),
(394,474,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(395,475,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(396,476,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(397,477,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(398,478,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(399,479,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(400,480,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(401,481,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(402,482,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(403,483,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(404,484,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(405,485,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(406,486,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(407,487,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(408,488,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(409,489,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(410,490,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(411,491,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(412,492,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(413,493,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(414,494,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(415,495,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(416,496,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(417,497,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(418,498,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(419,499,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(420,500,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(421,501,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(422,502,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(423,503,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(424,504,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(425,505,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(426,506,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(427,507,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(428,508,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(429,509,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(430,510,2,1,'2023-04-14 15:45:54',1,'2023-04-14 15:45:54','\0'),
(431,511,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(432,512,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(433,513,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(434,514,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(435,515,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(436,516,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(437,517,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(438,518,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(439,519,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(440,520,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(441,521,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(442,522,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(443,523,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(444,524,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(445,525,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(446,526,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(447,527,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(448,528,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(449,529,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(450,530,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(451,531,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(452,532,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(453,533,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(454,534,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(455,535,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(456,536,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(457,537,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(458,538,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(459,539,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(460,540,2,1,'2023-04-14 15:45:55',1,'2023-04-14 15:45:55','\0'),
(461,541,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(462,542,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(463,543,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(464,544,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(465,545,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(466,546,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(467,547,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(468,548,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(469,549,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(470,550,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(471,551,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(472,552,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(473,553,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(474,554,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(475,555,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(476,556,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(477,557,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(478,558,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(479,559,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(480,560,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(481,561,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(482,562,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(483,563,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(484,564,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(485,565,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(486,566,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(487,567,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(488,568,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(489,569,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(490,570,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(491,571,2,1,'2023-04-14 15:45:56',1,'2023-04-14 15:45:56','\0'),
(492,572,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(493,573,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(494,574,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(495,575,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(496,576,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(497,577,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(498,578,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(499,579,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(500,580,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(501,581,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(502,582,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(503,583,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(504,584,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(505,585,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(506,586,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(507,587,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(508,588,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(509,589,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(510,590,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(511,591,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(512,592,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(513,593,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(514,594,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(515,595,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(516,596,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(517,597,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(518,598,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(519,599,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(520,600,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(521,601,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(522,602,2,1,'2023-04-14 15:45:57',1,'2023-04-14 15:45:57','\0'),
(523,603,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(524,604,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(525,605,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(526,606,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(527,607,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(528,608,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(529,609,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(530,610,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(531,611,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(532,612,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(533,613,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(534,614,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(535,615,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(536,616,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(537,617,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(538,618,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(539,619,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(540,620,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(541,621,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(542,622,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(543,623,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(544,624,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(545,625,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(546,626,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(547,627,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(548,628,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(549,629,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(550,630,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(551,631,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(552,632,2,1,'2023-04-14 15:45:58',1,'2023-04-14 15:45:58','\0'),
(553,633,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(554,634,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(555,635,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(556,636,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(557,637,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(558,638,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(559,639,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(560,640,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(561,641,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(562,642,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(563,643,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(564,644,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(565,645,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(566,646,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(567,647,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(568,648,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(569,649,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(570,650,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(571,651,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(572,652,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(573,653,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(574,654,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(575,655,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(576,656,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(577,657,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(578,658,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(579,659,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(580,660,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(581,661,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(582,662,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(583,663,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(584,664,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(585,665,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(586,666,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(587,667,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(588,668,2,1,'2023-04-14 15:45:59',1,'2023-04-14 15:45:59','\0'),
(589,669,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(590,670,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(591,671,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(592,672,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(593,673,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(594,674,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(595,675,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(596,676,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(597,677,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(598,678,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(599,679,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(600,680,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(601,681,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(602,682,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(603,683,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(604,684,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(605,685,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(606,686,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(607,687,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(608,688,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(609,689,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(610,690,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(611,691,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(612,692,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(613,693,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(614,694,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(615,695,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(616,696,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(617,697,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(618,698,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(619,699,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(620,700,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(621,701,2,1,'2023-04-14 15:46:00',1,'2023-04-14 15:46:00','\0'),
(622,702,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(623,703,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(624,704,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(625,705,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(626,706,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(627,707,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(628,708,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(629,709,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(630,710,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(631,711,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(632,712,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(633,713,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(634,714,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(635,715,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(636,716,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(637,717,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(638,718,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(639,719,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(640,720,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(641,721,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(642,722,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(643,723,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(644,724,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(645,725,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(646,726,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(647,727,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(648,728,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(649,729,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(650,730,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(651,731,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(652,732,2,1,'2023-04-14 15:46:01',1,'2023-04-14 15:46:01','\0'),
(653,733,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(654,734,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(655,735,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(656,736,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(657,737,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(658,738,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(659,739,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(660,740,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(661,741,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(662,742,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(663,743,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(664,744,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(665,745,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(666,746,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(667,747,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(668,748,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(669,749,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(670,750,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(671,751,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(672,752,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(673,753,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(674,754,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(675,755,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(676,756,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(677,757,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(678,758,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(679,759,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(680,760,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(681,761,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(682,762,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(683,763,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(684,764,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(685,765,2,1,'2023-04-14 15:46:02',1,'2023-04-14 15:46:02','\0'),
(686,766,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(687,767,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(688,768,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(689,769,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(690,770,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(691,771,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(692,772,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(693,773,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(694,774,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(695,775,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(696,776,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(697,777,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(698,778,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(699,779,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(700,780,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(701,781,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(702,782,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(703,783,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(704,784,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(705,785,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(706,786,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(707,787,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(708,788,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(709,789,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(710,790,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(711,791,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(712,792,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(713,793,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(714,794,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(715,795,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(716,796,2,1,'2023-04-14 15:46:03',1,'2023-04-14 15:46:03','\0'),
(717,797,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(718,798,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(719,799,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(720,800,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(721,801,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(722,802,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(723,803,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(724,804,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(725,805,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(726,806,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(727,807,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(728,808,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(729,809,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(730,810,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(731,811,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(732,812,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(733,813,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(734,814,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(735,815,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(736,816,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(737,817,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(738,818,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(739,819,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(740,820,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(741,821,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(742,822,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(743,823,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(744,824,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(745,825,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(746,826,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(747,827,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(748,828,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(749,829,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(750,830,2,1,'2023-04-14 15:46:04',1,'2023-04-14 15:46:04','\0'),
(751,831,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(752,832,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(753,833,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(754,834,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(755,835,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(756,836,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(757,837,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(758,838,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(759,839,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(760,840,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(761,841,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(762,842,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(763,843,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(764,844,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(765,845,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(766,846,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(767,847,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(768,848,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(769,849,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(770,850,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(771,851,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(772,852,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(773,853,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(774,854,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(775,855,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(776,856,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(777,857,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(778,858,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(779,859,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(780,860,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(781,861,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(782,862,2,1,'2023-04-14 15:46:05',1,'2023-04-14 15:46:05','\0'),
(783,863,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(784,864,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(785,865,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(786,866,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(787,867,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(788,868,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(789,869,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(790,870,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(791,871,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(792,872,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(793,873,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(794,874,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(795,875,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(796,876,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(797,877,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(798,878,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(799,879,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(800,880,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(801,881,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(802,882,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(803,883,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(804,884,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(805,885,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(806,886,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(807,887,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(808,888,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(809,889,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(810,890,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(811,891,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(812,892,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(813,893,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(814,894,2,1,'2023-04-14 15:46:06',1,'2023-04-14 15:46:06','\0'),
(815,895,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(816,896,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(817,897,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(818,898,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(819,899,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(820,900,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(821,901,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(822,902,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(823,903,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(824,904,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(825,905,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(826,906,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(827,907,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(828,908,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(829,909,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(830,910,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(831,911,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(832,912,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(833,913,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(834,914,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(835,915,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(836,916,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(837,917,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(838,918,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(839,919,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(840,920,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(841,921,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(842,922,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(843,923,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(844,924,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(845,925,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(846,926,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(847,927,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(848,928,2,1,'2023-04-14 15:46:07',1,'2023-04-14 15:46:07','\0'),
(849,929,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(850,930,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(851,931,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(852,932,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(853,933,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(854,934,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(855,935,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(856,936,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(857,937,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(858,938,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(859,939,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(860,940,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(861,941,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(862,942,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(863,943,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(864,944,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(865,945,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(866,946,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(867,947,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(868,948,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(869,949,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(870,950,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(871,951,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(872,952,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(873,953,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(874,954,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(875,955,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(876,956,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(877,957,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(878,958,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(879,959,2,1,'2023-04-14 15:46:08',1,'2023-04-14 15:46:08','\0'),
(880,960,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(881,961,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(882,962,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(883,963,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(884,964,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(885,965,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(886,966,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(887,967,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(888,968,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(889,969,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(890,970,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(891,971,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(892,972,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(893,973,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(894,974,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(895,975,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(896,976,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(897,977,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(898,978,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(899,979,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(900,980,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(901,981,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(902,982,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(903,983,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(904,984,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(905,985,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(906,986,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(907,987,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(908,988,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(909,989,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(910,990,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(911,991,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(912,992,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(913,993,2,1,'2023-04-14 15:46:09',1,'2023-04-14 15:46:09','\0'),
(914,994,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(915,995,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(916,996,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(917,997,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(918,998,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(919,999,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(920,1000,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(921,1001,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(922,1002,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(923,1003,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(924,1004,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(925,1005,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(926,1006,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(927,1007,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(928,1008,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(929,1009,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(930,1010,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(931,1011,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(932,1012,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(933,1013,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(934,1014,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(935,1015,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(936,1016,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(937,1017,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(938,1018,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(939,1019,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(940,1020,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(941,1021,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(942,1022,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(943,1023,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(944,1024,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(945,1025,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(946,1026,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(947,1027,2,1,'2023-04-14 15:46:10',1,'2023-04-14 15:46:10','\0'),
(948,1028,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(949,1029,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(950,1030,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(951,1031,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(952,1032,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(953,1033,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(954,1034,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(955,1035,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(956,1036,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(957,1037,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(958,1038,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(959,1039,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(960,1040,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(961,1041,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(962,1042,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(963,1043,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(964,1044,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(965,1045,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(966,1046,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(967,1047,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(968,1048,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(969,1049,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(970,1050,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(971,1051,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(972,1052,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(973,1053,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(974,1054,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(975,1055,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(976,1056,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(977,1057,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(978,1058,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(979,1059,2,1,'2023-04-14 15:46:11',1,'2023-04-14 15:46:11','\0'),
(980,1060,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(981,1061,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(982,1062,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(983,1063,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(984,1064,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(985,1065,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(986,1066,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(987,1067,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(988,1068,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(989,1069,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(990,1070,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(991,1071,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(992,1072,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(993,1073,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(994,1074,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(995,1075,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(996,1076,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(997,1077,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(998,1078,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(999,1079,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1000,1080,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1001,1081,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1002,1082,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1003,1083,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1004,1084,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1005,1085,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1006,1086,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1007,1087,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1008,1088,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1009,1089,2,1,'2023-04-14 15:46:12',1,'2023-04-14 15:46:12','\0'),
(1010,1090,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1011,1091,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1012,1092,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1013,1093,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1014,1094,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1015,1095,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1016,1096,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1017,1097,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1018,1098,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1019,1099,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1020,1100,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1021,1101,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1022,1102,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1023,1103,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1024,1104,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1025,1105,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1026,1106,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1027,1107,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1028,1108,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1029,1109,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1030,1110,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1031,1111,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1032,1112,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1033,1113,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1034,1114,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1035,1115,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1036,1116,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1037,1117,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1038,1118,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1039,1119,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1040,1120,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1041,1121,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1042,1122,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1043,1123,2,1,'2023-04-14 15:46:13',1,'2023-04-14 15:46:13','\0'),
(1044,1124,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1045,1125,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1046,1126,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1047,1127,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1048,1128,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1049,1129,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1050,1130,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1051,1131,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1052,1132,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1053,1133,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1054,1134,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1055,1135,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1056,1136,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1057,1137,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1058,1138,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1059,1139,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1060,1140,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1061,1141,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1062,1142,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1063,1143,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1064,1144,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1065,1145,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1066,1146,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1067,1147,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1068,1148,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1069,1149,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1070,1150,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1071,1151,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1072,1152,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1073,1153,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1074,1154,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1075,1155,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1076,1156,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1077,1157,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1078,1158,2,1,'2023-04-14 15:46:14',1,'2023-04-14 15:46:14','\0'),
(1079,1159,2,1,'2023-04-14 15:46:15',1,'2023-04-14 15:46:15','\0'),
(1080,1160,2,1,'2023-04-14 15:46:15',1,'2023-04-14 15:46:15','\0'),
(1083,1166,5,1,'2023-04-21 09:24:37',1,'2023-05-24 16:48:47',''),
(1084,1167,5,1,'2023-04-21 09:24:37',1,'2023-05-24 16:48:47',''),
(1085,1168,5,1,'2023-04-21 09:24:37',1,'2023-05-24 16:48:47',''),
(1086,1169,5,1,'2023-04-21 09:24:37',1,'2023-05-24 16:48:47',''),
(1087,1170,5,1,'2023-04-21 09:24:37',1,'2023-05-24 16:48:47',''),
(1088,1171,5,1,'2023-04-21 09:24:37',1,'2023-05-24 16:48:47',''),
(1089,1172,5,1,'2023-04-21 09:24:37',1,'2023-05-24 16:48:47','');

/*Table structure for table `data_label` */

DROP TABLE IF EXISTS `data_label`;

CREATE TABLE `data_label` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL DEFAULT '',
  `color` varchar(7) NOT NULL DEFAULT '#000000',
  `create_user_id` bigint(20) DEFAULT NULL,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_user_id` bigint(20) DEFAULT NULL,
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) NOT NULL DEFAULT b'0',
  `type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '标签类型 0:自定义标签 1:自动标注标签 2:ImageNet 3: MS COCO',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `dataset` (`name`,`deleted`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=1173 DEFAULT CHARSET=utf8mb4 COMMENT='数据集标签';

/*Data for the table `data_label` */

insert  into `data_label`(`id`,`name`,`color`,`create_user_id`,`create_time`,`update_user_id`,`update_time`,`deleted`,`type`) values 

























































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































/*Table structure for table `data_label_group` */

DROP TABLE IF EXISTS `data_label_group`;

CREATE TABLE `data_label_group` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL DEFAULT '' COMMENT '标签组名称',
  `create_user_id` bigint(20) DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_user_id` bigint(20) DEFAULT NULL,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) NOT NULL DEFAULT b'0',
  `remark` varchar(255) DEFAULT NULL COMMENT '描述',
  `type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '类型 0: private 私有标签组,  1:public 公开标签组',
  `origin_user_id` bigint(20) DEFAULT NULL COMMENT '资源拥有人',
  `operate_type` int(11) DEFAULT NULL COMMENT '操作类型 1:Json编辑器操作类型 2:自定义操作类型 3:导入操作类型',
  `label_group_type` int(11) NOT NULL DEFAULT '0' COMMENT '标签组数据类型  0:视觉  1:文本',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COMMENT='标签组';

/*Data for the table `data_label_group` */

insert  into `data_label_group`(`id`,`name`,`create_user_id`,`create_time`,`update_user_id`,`update_time`,`deleted`,`remark`,`type`,`origin_user_id`,`operate_type`,`label_group_type`) values 
(1,'COCO',0,'2023-04-14 15:45:41',1,'2023-04-20 14:34:45','\0','coco数据集标签',1,0,NULL,0),
(2,'Imagenet',0,'2023-04-14 15:45:41',1,'2023-04-20 14:34:55','\0','Imagenet标签',1,0,NULL,0);

/*Table structure for table `data_medicine` */

DROP TABLE IF EXISTS `data_medicine`;

CREATE TABLE `data_medicine` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `name` varchar(255) NOT NULL COMMENT '数据集名称',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '更新用户ID',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `deleted` bit(1) NOT NULL DEFAULT b'0' COMMENT '0-正常 1-已删除',
  `status` smallint(6) DEFAULT NULL COMMENT '状态 101-未标注 103-自动标注中 104-自动标注完成 105-完成',
  `patient_id` varchar(50) DEFAULT NULL COMMENT '检查号(CT号或CR、DR号)',
  `study_instance_uid` varchar(64) DEFAULT NULL COMMENT '研究实例UID',
  `series_instance_uid` varchar(64) DEFAULT NULL COMMENT '序列实例UID',
  `modality` varchar(50) DEFAULT NULL COMMENT '模式',
  `body_part_examined` varchar(50) DEFAULT NULL COMMENT '部位',
  `merge_annotation` text COMMENT '自动标注内容合并后结果',
  `remark` varchar(255) DEFAULT NULL,
  `origin_user_id` bigint(20) NOT NULL COMMENT '资源拥有人',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '类型 0: private 私有数据,  1:team  团队数据  2:public 公开数据',
  `annotate_type` smallint(6) NOT NULL DEFAULT '0' COMMENT '标注类型: 1.器官分割 2.病灶检测之肺结节检测',
  `stop` bit(1) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='医学数据集';

/*Data for the table `data_medicine` */

/*Table structure for table `data_medicine_file` */

DROP TABLE IF EXISTS `data_medicine_file`;

CREATE TABLE `data_medicine_file` (
  `id` bigint(20) unsigned zerofill NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '更新用户ID',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `deleted` bit(1) NOT NULL DEFAULT b'0' COMMENT '0-正常 1-已删除',
  `medicine_id` bigint(20) DEFAULT NULL COMMENT '数据集ID',
  `name` varchar(225) DEFAULT NULL COMMENT '文件名称',
  `url` varchar(255) DEFAULT NULL COMMENT '文件地址',
  `instance_number` smallint(6) DEFAULT NULL COMMENT '实例序号',
  `sop_instance_uid` varchar(64) DEFAULT NULL COMMENT 'SOP实例UID',
  `origin_user_id` bigint(20) DEFAULT NULL COMMENT '资源拥有人',
  `status` tinyint(4) DEFAULT NULL COMMENT '状态 101-未标注 103-自动标注完成 104-完成',
  `image_position_patient` double(11,1) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='医学数据集';

/*Data for the table `data_medicine_file` */

/*Table structure for table `data_sequence` */

DROP TABLE IF EXISTS `data_sequence`;

CREATE TABLE `data_sequence` (
  `id` int(11) NOT NULL,
  `business_code` varchar(50) NOT NULL,
  `start` int(11) NOT NULL,
  `step` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `business_code_unique` (`business_code`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='自定义获取主键ID表';

/*Data for the table `data_sequence` */

insert  into `data_sequence`(`id`,`business_code`,`start`,`step`) values 
(1,'DATA_FILE',25000,5000),
(2,'DATA_VERSION_FILE',20000,5000),
(3,'DATA_FILE_ANNOTATION',40000,5000);

/*Table structure for table `data_task` */

DROP TABLE IF EXISTS `data_task`;

CREATE TABLE `data_task` (
  `id` bigint(20) unsigned zerofill NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `total` int(11) NOT NULL DEFAULT '0' COMMENT '任务需要处理的文件总数',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '任务状态 0.待分配 1.分配中 2.进行中 3.已完成 4.失败',
  `finished` int(11) NOT NULL DEFAULT '0' COMMENT '已完成的文件数',
  `failed` int(11) NOT NULL DEFAULT '0' COMMENT '失败文件数量',
  `files` varchar(255) CHARACTER SET utf8 DEFAULT '' COMMENT '文件id数组',
  `dataset_id` bigint(20) DEFAULT NULL COMMENT '数据集ID',
  `annotate_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '标注类型：0分类,1目标检测',
  `data_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '数据类型:0图片，1视频',
  `labels` text CHARACTER SET utf8 NOT NULL COMMENT '该自动标注任务使用的标签数组，json串形式',
  `deleted` bit(1) NOT NULL DEFAULT b'0' COMMENT '0正常，1已删除',
  `datasets` varchar(255) CHARACTER SET utf8 DEFAULT '' COMMENT '数据集id数组',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `type` smallint(6) DEFAULT NULL COMMENT '任务类型 0.自动标注 1.ofrecord 2.imageNet 3.数据增强 4.目标跟踪 5.视频采样',
  `dataset_version_id` bigint(20) DEFAULT NULL COMMENT '数据集版本ID',
  `enhance_type` text CHARACTER SET utf8 COMMENT '增强类型数组',
  `url` varchar(255) CHARACTER SET utf8 DEFAULT NULL COMMENT '视频文件url',
  `frame_interval` int(11) DEFAULT NULL COMMENT '视频帧间隔',
  `merge_column` varchar(255) DEFAULT NULL COMMENT 'csv合并列',
  `version_name` varchar(255) DEFAULT NULL COMMENT '转预置版本号',
  `target_id` bigint(20) DEFAULT NULL COMMENT '目标数据集id',
  `model_service_id` bigint(20) DEFAULT NULL COMMENT '模型服务id',
  `file_type` smallint(6) DEFAULT NULL COMMENT '待处理文件类型 0-全部 304-无标注 303-有标注',
  `stop` bit(1) DEFAULT NULL COMMENT '是否停止 0-没有 1-已停止',
  `of_record_version` varchar(255) DEFAULT NULL COMMENT '生成ofRecord的版本号',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `deleted` (`deleted`) USING BTREE,
  KEY `ds_status` (`datasets`,`status`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='标注任务信息';

/*Data for the table `data_task` */

/*Table structure for table `dict` */

DROP TABLE IF EXISTS `dict`;

CREATE TABLE `dict` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `remark` varchar(255) DEFAULT NULL,
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

/*Data for the table `dict` */

insert  into `dict`(`id`,`name`,`remark`,`create_time`,`update_time`) values 
(1,'Layout','页面布局','2023-04-14 15:44:51','2023-04-14 15:44:51'),
(2,'user_status','用户状态','2023-04-14 15:44:51','2023-04-14 15:44:51'),
(8,'model_class','模型分类','2023-04-14 15:44:52','2023-04-14 15:44:52'),
(11,'dataset_type','数据集分类','2023-04-14 15:44:53','2023-04-14 15:44:53'),
(12,'dataset_enhance','数据集增强','2023-04-14 15:44:53','2023-04-14 15:44:53'),
(40,'dataset_occasion','数据集场景类型','2023-04-14 15:49:50','2023-04-14 15:49:50');

/*Table structure for table `dict_detail` */

DROP TABLE IF EXISTS `dict_detail`;

CREATE TABLE `dict_detail` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `dict_id` bigint(20) DEFAULT NULL,
  `label` varchar(255) NOT NULL,
  `value` varchar(255) NOT NULL,
  `sort` bigint(20) DEFAULT '999',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=144 DEFAULT CHARSET=utf8;

/*Data for the table `dict_detail` */

insert  into `dict_detail`(`id`,`dict_id`,`label`,`value`,`sort`,`create_time`,`update_time`) values 
(1,1,'基本布局','BaseLayout',1,'2023-04-14 15:44:51','2023-04-14 15:44:51'),
(2,1,'二级页面','SubpageLayout',2,'2023-04-14 15:44:51','2023-04-14 15:44:51'),
(3,1,'详情页面','DetailLayout',3,'2023-04-14 15:44:51','2023-04-14 15:44:51'),
(4,1,'数据集页面','DatasetLayout',4,'2023-04-14 15:44:51','2023-04-14 15:44:51'),
(5,2,'激活','true',1,'2023-04-14 15:44:51','2023-04-14 15:44:51'),
(6,2,'锁定','false',2,'2023-04-14 15:44:51','2023-04-14 15:44:51'),
(61,11,'图像分类','0',1,'2023-04-14 15:44:53','2023-04-14 15:44:53'),
(62,11,'目标检测','1',2,'2023-04-14 15:44:53','2023-04-14 15:44:53'),
(63,11,'目标跟踪','2',3,'2023-04-14 15:44:53','2023-04-14 15:44:53'),
(64,12,'去雾','1',1,'2023-04-14 15:44:53','2023-04-14 15:44:53'),
(65,12,'增雾','2',2,'2023-04-14 15:44:53','2023-04-14 15:44:53'),
(66,12,'对比度增强','3',3,'2023-04-14 15:44:53','2023-04-14 15:44:53'),
(67,12,'直方图均衡化','4',4,'2023-04-14 15:44:53','2023-04-14 15:44:53'),
(127,40,'普通数据集','0',1,'2023-04-14 15:49:50','2023-04-14 15:49:50'),
(128,40,'重组训练-单任务','1',1,'2023-04-14 15:49:50','2023-04-14 15:49:50'),
(129,40,'重组训练-多任务','2',2,'2023-04-14 15:49:50','2023-04-14 15:49:50'),
(130,8,'图像分类','101',1,'2023-04-14 15:51:37','2023-04-14 15:51:37'),
(131,8,'目标检测','102',2,'2023-04-14 15:51:37','2023-04-14 15:51:37'),
(132,8,'语义分割','103',3,'2023-04-14 15:51:37','2023-04-14 15:51:37'),
(133,8,'文本分类','301',5,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(134,8,'目标跟踪','201',4,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(135,8,'中文分词','302',6,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(136,8,'命名实体识别','303',7,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(137,8,'音频分类','401',8,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(138,8,'语音识别','402',9,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(139,8,'自定义','10001',13,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(140,8,'器官分割','1001',10,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(141,8,'肺结节检测','2001',11,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(142,8,'其他病灶识别','2999',12,'2023-04-14 15:51:38','2023-04-14 15:51:38'),
(143,8,'模型优化','5001',13,'2023-04-14 15:51:38','2023-04-14 15:51:38');

/*Table structure for table `menu` */

DROP TABLE IF EXISTS `menu`;

CREATE TABLE `menu` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `pid` bigint(20) NOT NULL DEFAULT '0' COMMENT '上级菜单ID',
  `type` int(11) NOT NULL DEFAULT '0' COMMENT '菜单类型: 0目录，1页面，2权限，3外链',
  `name` varchar(255) DEFAULT NULL COMMENT '名称',
  `icon` varchar(255) DEFAULT NULL COMMENT '菜单图标',
  `path` varchar(255) DEFAULT NULL COMMENT '路径或外链URL',
  `component` varchar(255) DEFAULT NULL COMMENT '组件路径',
  `component_name` varchar(255) DEFAULT NULL COMMENT '路由名称',
  `layout` varchar(255) DEFAULT NULL COMMENT '页面布局类型',
  `permission` varchar(255) DEFAULT NULL COMMENT '权限标识',
  `back_to` varchar(255) DEFAULT NULL COMMENT '上级菜单',
  `ext_config` varchar(255) DEFAULT NULL COMMENT '扩展配置',
  `hidden` bit(1) DEFAULT b'0' COMMENT '菜单栏不显示',
  `cache` bit(1) DEFAULT b'0' COMMENT '路由缓存 keep-alive',
  `sort` bigint(20) DEFAULT '999' COMMENT '菜单排序',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人id',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) DEFAULT b'0' COMMENT '删除标记 0正常，1已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1101 DEFAULT CHARSET=utf8;

/*Data for the table `menu` */

insert  into `menu`(`id`,`pid`,`type`,`name`,`icon`,`path`,`component`,`component_name`,`layout`,`permission`,`back_to`,`ext_config`,`hidden`,`cache`,`sort`,`create_user_id`,`update_user_id`,`create_time`,`update_time`,`deleted`) values 
(1,0,1,'概览','gailannew','dashboard','dashboard/dashboard','Dashboard','BaseLayout',NULL,NULL,NULL,'\0','\0',1,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:51:21','\0'),
(10,0,0,'数据管理','shujuguanlinew','data',NULL,NULL,NULL,'data',NULL,NULL,'\0','\0',2,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:51:21','\0'),
(11,10,1,'数据集管理','shujujiguanli','datasets/list','dataset/list','Datasets','BaseLayout','data:dataset',NULL,NULL,'','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:51:21','\0'),
(13,10,1,'目标检测详情',NULL,'datasets/annotate/:datasetId/file/:fileId','dataset/annotate','AnnotateDatasetFile','DetailLayout',NULL,NULL,NULL,'','\0',999,NULL,1,'2023-04-14 15:44:51','2023-05-17 10:48:36','\0'),
(14,10,1,'目标检测',NULL,'datasets/annotate/:datasetId','dataset/annotate','AnnotateDataset','DetailLayout',NULL,NULL,NULL,'','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(15,10,1,'目标跟踪详情',NULL,'datasets/track/:datasetId/file/:fileId','dataset/annotate','TrackDatasetFile','DatasetLayout',NULL,NULL,NULL,'','\0',999,NULL,1,'2023-04-14 15:44:51','2023-05-17 10:48:45','\0'),
(16,10,1,'目标跟踪',NULL,'datasets/track/:datasetId','dataset/annotate','TrackDataset','DatasetLayout',NULL,NULL,NULL,'','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(17,10,1,'数据集版本管理',NULL,'datasets/:datasetId/version','dataset/version','DatasetVersion','SubpageLayout',NULL,NULL,NULL,'','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(30,0,0,'算法开发','suanfakaifanew','development',NULL,NULL,NULL,'development',NULL,NULL,'\0','\0',3,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:16',''),
(31,30,1,'Notebook','notebook','notebook','development/notebook','Notebook','BaseLayout','notebook',NULL,NULL,'\0','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:16',''),
(32,30,1,'算法管理','suanfaguanli','algorithm','algorithm/index','Algorithm','BaseLayout','development:algorithm',NULL,NULL,'\0','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:16',''),
(40,0,0,'训练管理','xunlianguanlinew','training',NULL,NULL,NULL,'training',NULL,NULL,'\0','\0',4,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:20',''),
(41,0,1,'镜像管理','jingxiangguanlinew','image','trainingImage/index','TrainingImage','BaseLayout','training:image',NULL,NULL,'\0','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:53',''),
(42,40,1,'训练任务','xunlianrenwu','job','trainingJob/index','TrainingJob','BaseLayout','training:job',NULL,NULL,'\0','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:20',''),
(43,40,1,'任务详情',NULL,'jobDetail','trainingJob/detail','JobDetail','SubpageLayout',NULL,NULL,NULL,'','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:20',''),
(44,40,1,'添加任务',NULL,'jobAdd','trainingJob/add','jobAdd','SubpageLayout',NULL,NULL,NULL,'','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:20',''),
(45,40,1,'可视化任务','keshihuarenwu','visual','trainingJob/trainingVisualList','TrainVisual','BaseLayout','training:visual',NULL,NULL,'\0','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:03:20',''),
(50,0,1,'模型管理','moxingguanlinew','model',NULL,NULL,NULL,'model',NULL,NULL,'\0','\0',5,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:04:15',''),
(51,50,1,'模型列表','moxingliebiao','model','model/index','ModelModel','BaseLayout','model:model',NULL,NULL,'\0','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:04:15',''),
(52,50,1,'模型优化','moxingyouhua','optimize','modelOptimize/index','ModelOptimize','BaseLayout','model:optimize',NULL,NULL,'\0','\0',52,1,1,'2023-04-14 15:44:51','2023-04-17 15:04:15',''),
(53,50,1,'模型版本管理',NULL,'version','model/version','ModelVersion','SubpageLayout','model:branch',NULL,NULL,'','\0',999,NULL,1,'2023-04-14 15:44:51','2023-04-17 15:04:15',''),
(54,50,1,'模型优化执行记录',NULL,'optimize/record','modelOptimize/record','ModelOptRecord','SubpageLayout',NULL,NULL,NULL,'','\0',54,1,1,'2023-04-14 15:44:51','2023-04-17 15:04:15',''),
(90,0,0,'控制台','kongzhitainew','system',NULL,NULL,NULL,'system',NULL,NULL,'\0','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(91,90,1,'用户管理','yonghuguanlinew','user','system/user/index','SystemUser','BaseLayout','system:user',NULL,NULL,'\0','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(92,90,1,'角色管理','jueseguanli','role','system/role/index','SystemRole','BaseLayout','system:role',NULL,NULL,'\0','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(93,90,1,'菜单管理','caidanguanlinew','menu','system/menu/index','SystemMenu','BaseLayout','system:menu',NULL,NULL,'\0','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(94,90,1,'字典管理','zidianguanli','dict','system/dict/index','SystemDict','BaseLayout','system:dict',NULL,NULL,'\0','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(95,90,1,'集群状态','jiqunzhuangtai','node','system/node/index','SystemNode','BaseLayout','system:node',NULL,NULL,'\0','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-05-16 17:07:32',''),
(96,90,1,'回收站','huishouzhannew','recycle','system/recycle/index','SystemRecycle','BaseLayout','system:recycle',NULL,NULL,'\0','\0',999,1,1,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(97,0,0,'模型炼知','moxinglianzhinew','atlas',NULL,NULL,NULL,NULL,NULL,NULL,'\0','\0',70,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:27',''),
(100,10,1,'编辑标签组',NULL,'labelgroup/edit','labelGroup/labelGroupForm','LabelGroupEdit','SubpageLayout',NULL,NULL,NULL,'','\0',24,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(101,10,1,'标签组详情',NULL,'labelgroup/detail','labelGroup/labelGroupForm','LabelGroupDetail','SubpageLayout',NULL,NULL,NULL,'','\0',23,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(102,10,1,'创建标签组',NULL,'labelgroup/create','labelGroup/labelGroupForm','LabelGroupCreate','SubpageLayout',NULL,NULL,NULL,'','\0',22,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(103,10,1,'标签组管理','biaoqianzuguanli','labelgroup','labelGroup/index','LabelGroup','BaseLayout','',NULL,NULL,'\0','\0',21,1,1,'2023-04-14 15:44:51','2023-04-14 15:51:21','\0'),
(1058,0,0,'云端部署','yunduanbushu','cloudserving',NULL,NULL,NULL,NULL,NULL,NULL,'\0','\0',60,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:32',''),
(1059,1058,1,'在线服务','zaixianfuwu','onlineserving','cloudServing','CloudServing','BaseLayout','serving:online',NULL,NULL,'\0','\0',61,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:32',''),
(1060,1058,1,'批量服务','piliangfuwu','batchserving','cloudServing/batch','BatchServing','BaseLayout','serving:batch',NULL,NULL,'\0','\0',62,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:32',''),
(1061,1058,1,'部署详情',NULL,'onlineserving/detail','cloudServing/detail','CloudServingDetail','SubpageLayout','serving:online',NULL,NULL,'','\0',63,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:32',''),
(1062,1058,1,'部署详情',NULL,'batchserving/detail','cloudServing/batchDetail','BatchServingDetail','SubpageLayout','serving:batch',NULL,NULL,'','\0',64,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:32',''),
(1063,1058,1,'部署在线服务',NULL,'onlineserving/form','cloudServing/formPage','CloudServingForm','SubpageLayout','serving:online',NULL,NULL,'','\0',65,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:32',''),
(1064,97,1,'度量管理','duliangguanli','measure','atlas/measure','Measure','BaseLayout','atlas:measure',NULL,NULL,'\0','\0',71,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:27',''),
(1065,97,1,'图谱可视化','tupukeshihua','graphvisual','atlas/graphVisual','AtlasGraphVisual','BaseLayout',NULL,NULL,NULL,'\0','\0',72,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:27',''),
(1066,97,1,'图谱列表','tupuliebiao','graph','atlas/graphList','AtlasGraph','BaseLayout',NULL,NULL,NULL,'\0','\0',73,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:27',''),
(1067,10,1,'图像语义分割详情',NULL,'datasets/segmentation/:datasetId','dataset/annotate','SegmentationDataset','DatasetLayout',NULL,NULL,'{\"test\": 1}','','\0',19,1,1,'2023-04-14 15:44:51','2023-05-17 10:48:58','\0'),
(1068,10,1,'图像语义分割',NULL,'datasets/segmentation/:datasetId/file/:fileId','dataset/annotate','SegmentationDatasetFile','DatasetLayout',NULL,NULL,NULL,'','\0',18,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(1069,10,1,'医学影像阅读','beauty','datasets/medical/viewer/:medicalId','dataset/medical/viewer','DatasetMedicalViewer','FullpageLayout',NULL,NULL,NULL,'','\0',999,1,1,'2023-04-14 15:44:51','2023-05-16 17:08:10',''),
(1070,10,1,'数据集管理','shujujiguanli','datasets','dataset/fork','DatasetFork','BaseLayout',NULL,NULL,NULL,'\0','\0',17,1,1,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(1071,10,1,'医疗影像数据集',NULL,'datasets/medical','dataset/medical/list','DatasetMedical','BaseLayout',NULL,NULL,NULL,'','\0',25,1,1,'2023-04-14 15:44:51','2023-05-16 17:08:05',''),
(1072,10,1,'数据集场景选择',NULL,'datasets/entrance','dataset/entrance','Entrance','BaseLayout',NULL,NULL,NULL,'','\0',20,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(1073,10,1,'文本分类详情',NULL,'datasets/textclassify/:datasetId','dataset/nlp/textClassify','TextClassify','DetailLayout','',NULL,NULL,'','\0',26,1,1,'2023-04-14 15:44:51','2023-05-17 10:49:07','\0'),
(1074,10,1,'文本标注',NULL,'datasets/text/annotation/:datasetId','dataset/nlp/annotation','TextAnnotation','DetailLayout',NULL,NULL,NULL,'','\0',27,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(1075,10,1,'导入表格',NULL,'datasets/table/import','dataset/tableImport','TableImport','DetailLayout',NULL,NULL,'{}','','\0',999,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(1076,90,1,'用户组管理','yonghuzuguanli','userGroup','system/userGroup','UserGroup','BaseLayout','system:userGroup',NULL,'{}','\0','\0',91,3,3,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(1077,90,1,'权限管理','quanxianguanli','authCode','system/authCode','AuthCode','BaseLayout','system:authCode',NULL,'{}','\0','\0',92,1,3,'2023-04-14 15:44:51','2023-04-14 15:51:22','\0'),
(1078,10,1,'文本数据集',NULL,'datasets/text/list/:datasetId','dataset/nlp/list','TextList','DetailLayout',NULL,NULL,'{}','','\0',999,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(1079,10,1,'音频数据集',NULL,'datasets/audio/list/:datasetId','dataset/audio/list','AudioList','DetailLayout',NULL,NULL,'{}','','\0',999,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(1080,10,1,'音频标注',NULL,'datasets/audio/annotation/:datasetId','dataset/audio/annotation','AudioAnnotation','DetailLayout',NULL,NULL,'{}','','\0',999,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(1081,10,1,'自定义数据集',NULL,'datasets/custom/:datasetId','dataset/custom','CustomList','DetailLayout',NULL,NULL,'{}','','\0',999,1,1,'2023-04-14 15:44:51','2023-04-14 15:44:51','\0'),
(1084,90,1,'资源规格管理','ziyuanguige','resources','system/resources','Resources','BaseLayout','system:specs',NULL,NULL,'\0','\0',999,NULL,NULL,'2023-04-14 15:44:51','2023-05-16 17:07:28',''),
(1085,0,0,'自动机器学习','zidongjiqi','tadl',NULL,NULL,NULL,'TADL',NULL,NULL,'\0','\0',35,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:37',''),
(1086,1085,1,'实验详情',NULL,'experiment/:experimentId','tadl/detail','ExperimentDetail','DetailLayout',NULL,NULL,NULL,'','\0',999,1,1,'2023-04-14 15:44:51','2023-04-17 15:03:37',''),
(1087,1085,1,'实验管理','shiyanguanlinew','list','tadl/list/index','TadlList','BaseLayout','tadl',NULL,NULL,'\0','\0',36,3,1,'2023-04-14 15:44:51','2023-04-17 15:03:37',''),
(1088,1085,1,'TadlForm',NULL,'form','tadl/formPage','TadlForm','SubpageLayout','tadl',NULL,NULL,'','\0',999,3,1,'2023-04-14 15:44:51','2023-04-17 15:03:37',''),
(1089,1085,1,'搜索策略','sousuochelve','searchstrategy','tadl/strategy/index','SearchStrategy','BaseLayout','tadl',NULL,NULL,'\0','\0',37,14,1,'2023-04-14 15:44:51','2023-04-17 15:03:37',''),
(1090,0,0,'天枢专业版','tianshu','terminal',NULL,NULL,NULL,'terminal',NULL,NULL,'\0','\0',80,3,1,'2023-04-14 15:49:12','2023-04-17 15:03:42',''),
(1091,1090,1,'终端概览','zhongduangailan','overview','terminal/overview','TerminalOverview','BaseLayout','terminal:terminals',NULL,NULL,'\0','\0',81,3,1,'2023-04-14 15:49:12','2023-04-17 15:03:42',''),
(1092,1090,1,'远程连接','yuanchenglianjie','remote','terminal/remote','TerminalRemote','BaseLayout','terminal:remote',NULL,NULL,'\0','\0',82,3,1,'2023-04-14 15:49:12','2023-04-17 15:03:42',''),
(1093,40,1,'创建重组任务',NULL,'atlasJobAdd','trainingJob/atlasAdd','AtlasJobAdd','SubpageLayout',NULL,NULL,NULL,'','\0',44,63,1,'2022-06-14 10:54:50','2023-04-17 15:03:20',''),
(1094,0,3,'数据可视化分析','vis-logo','https://nebula-dev.zjvis.net',NULL,'Vis',NULL,NULL,NULL,NULL,'\0','\0',85,1,1,'2022-07-27 13:50:23','2023-04-17 15:07:05',''),
(1095,10,1,'文本分类',NULL,'datasets/text/classify/:datasetId','dataset/nlp/textClassify','TextClassify','DetailLayout',NULL,NULL,'','','\0',29,67,67,'2022-06-20 14:46:39','2022-06-29 10:11:00','\0'),
(1096,10,1,'图像分类',NULL,'datasets/classification/:datasetId','dataset/classification/index','DatasetClassification','DetailLayout','dataset',NULL,'','','\0',12,67,67,'2022-06-08 11:10:32','2022-06-29 10:04:11','\0'),
(1097,10,1,'3D点云数据集',NULL,'datasets/pointcloud','dataset/pointCloud/list','PointCloud','BaseLayout',NULL,NULL,'','','\0',45,14,14,'2023-04-14 15:51:38','2023-05-16 17:07:52',''),
(1098,10,1,'点云编辑器',NULL,'datasets/pointcloud/editor','dataset/pointCloud/editor','PointCloudEditor','FullpageLayout',NULL,NULL,'','','\0',56,14,14,'2023-04-14 15:51:38','2023-05-16 17:07:55',''),
(1099,97,1,'模型重组','moxingchongzu','restructuring','atlas/modelRestructuring','ModelRestructuring','BaseLayout',NULL,NULL,NULL,'\0','\0',70,3,1,'2022-06-20 10:44:14','2023-04-17 15:03:27',''),
(1100,10,1,'标注服务管理','biaozhufuwu','datasets/model-service','dataset/modelService','ModelDataService','BaseLayout',NULL,NULL,'','','\0',999,1,1,'2022-05-24 15:05:50','2023-05-24 09:51:08','\0');

/*Table structure for table `oauth_access_token` */

DROP TABLE IF EXISTS `oauth_access_token`;

CREATE TABLE `oauth_access_token` (
  `token_id` varchar(256) DEFAULT NULL,
  `token` blob,
  `authentication_id` varchar(256) DEFAULT NULL,
  `user_name` varchar(256) DEFAULT NULL,
  `client_id` varchar(256) DEFAULT NULL,
  `authentication` blob,
  `refresh_token` varchar(256) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='auth token存储表';

/*Data for the table `oauth_access_token` */

insert  into `oauth_access_token`(`token_id`,`token`,`authentication_id`,`user_name`,`client_id`,`authentication`,`refresh_token`) values 
('5b15869971561c0872e5c4a2161174d7','��\0sr\0Corg.springframework.security.oauth2.common.DefaultOAuth2AccessToken��6$��\0L\0additionalInformationt\0Ljava/util/Map;L\0\nexpirationt\0Ljava/util/Date;L\0refreshTokent\0?Lorg/springframework/security/oauth2/common/OAuth2RefreshToken;L\0scopet\0Ljava/util/Set;L\0	tokenTypet\0Ljava/lang/String;L\0valueq\0~\0xpsr\0java.util.LinkedHashMap4�N\\l��\0Z\0accessOrderxr\0java.util.HashMap���`�\0F\0\nloadFactorI\0	thresholdxp?@\0\0\0\0\0w\0\0\0\0\0\0t\0jtit\0$ce43cd5b-2181-4069-b5f0-6e51be7c277ax\0sr\0java.util.Datehj�KYt\0\0xpw\0\0�M+gxsr\0Lorg.springframework.security.oauth2.common.DefaultExpiringOAuth2RefreshToken/�Gc��ɷ\0L\0\nexpirationq\0~\0xr\0Dorg.springframework.security.oauth2.common.DefaultOAuth2RefreshTokens�\ncT�^\0L\0valueq\0~\0xpt5eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE2ODc1MTAyNzAsInVzZXJfbmFtZSI6ImFkbWluIiwianRpIjoiOTJjNmNkMTQtZTNkZi00NzRmLTg5ZjItZjZkMjliNTZjZGQ0IiwiY2xpZW50X2lkIjoiZHViaGUtY2xpZW50Iiwic2NvcGUiOlsiYWxsIl0sImF0aSI6ImNlNDNjZDViLTIxODEtNDA2OS1iNWYwLTZlNTFiZTdjMjc3YSJ9.uDhVqInTIS35zWu5qAP4pJOdjkjhsDjMET-JqGXCvGYsq\0~\0w\0\0��s@�xsr\0%java.util.Collections$UnmodifiableSet��я��U\0\0xr\0,java.util.Collections$UnmodifiableCollectionB\0��^�\0L\0ct\0Ljava/util/Collection;xpsr\0java.util.LinkedHashSet�l�Z��*\0\0xr\0java.util.HashSet�D�����4\0\0xpw\0\0\0?@\0\0\0\0\0t\0allxt\0bearert\0�eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE2ODQ5MjE4NzAsInVzZXJfbmFtZSI6ImFkbWluIiwianRpIjoiY2U0M2NkNWItMjE4MS00MDY5LWI1ZjAtNmU1MWJlN2MyNzdhIiwiY2xpZW50X2lkIjoiZHViaGUtY2xpZW50Iiwic2NvcGUiOlsiYWxsIl19.JghCtokdOAwvCHH7ZNWqWe4I48SC-aMeoOSKerLOu2I','4ac7605bb6104a323ee40aa37e92ec1f','admin','dubhe-client','��\0sr\0Aorg.springframework.security.oauth2.provider.OAuth2Authentication�@bR\0L\0\rstoredRequestt\0<Lorg/springframework/security/oauth2/provider/OAuth2Request;L\0userAuthenticationt\02Lorg/springframework/security/core/Authentication;xr\0Gorg.springframework.security.authentication.AbstractAuthenticationTokenӪ(~nGd\0Z\0\rauthenticatedL\0authoritiest\0Ljava/util/Collection;L\0detailst\0Ljava/lang/Object;xp\0sr\0&java.util.Collections$UnmodifiableList�%1��\0L\0listt\0Ljava/util/List;xr\0,java.util.Collections$UnmodifiableCollectionB\0��^�\0L\0cq\0~\0xpsr\0java.util.ArrayListx����a�\0I\0sizexp\0\0\0\0w\0\0\0\0xq\0~\0psr\0:org.springframework.security.oauth2.provider.OAuth2Request\0\0\0\0\0\0\0\0Z\0approvedL\0authoritiesq\0~\0L\0\nextensionst\0Ljava/util/Map;L\0redirectUrit\0Ljava/lang/String;L\0refresht\0;Lorg/springframework/security/oauth2/provider/TokenRequest;L\0resourceIdst\0Ljava/util/Set;L\0\rresponseTypesq\0~\0xr\08org.springframework.security.oauth2.provider.BaseRequest6(z>�qi�\0L\0clientIdq\0~\0L\0requestParametersq\0~\0L\0scopeq\0~\0xpt\0dubhe-clientsr\0%java.util.Collections$UnmodifiableMap��t�B\0L\0mq\0~\0xpsr\0java.util.HashMap���`�\0F\0\nloadFactorI\0	thresholdxp?@\0\0\0\0\0w\0\0\0\0\0\0t\0\ngrant_typet\0passwordt\0	client_idt\0dubhe-clientt\0scopet\0allt\0usernamet\0adminxsr\0%java.util.Collections$UnmodifiableSet��я��U\0\0xq\0~\0	sr\0java.util.LinkedHashSet�l�Z��*\0\0xr\0java.util.HashSet�D�����4\0\0xpw\0\0\0?@\0\0\0\0\0q\0~\0xsq\0~\0$w\0\0\0?@\0\0\0\0\0\0xsq\0~\0?@\0\0\0\0\0\0w\0\0\0\0\0\0\0xppsq\0~\0$w\0\0\0?@\0\0\0\0\0\0xsq\0~\0$w\0\0\0?@\0\0\0\0\0\0xsr\0Oorg.springframework.security.authentication.UsernamePasswordAuthenticationToken\0\0\0\0\0\0\0L\0credentialsq\0~\0L\0	principalq\0~\0xq\0~\0sr\0java.util.Collections$EmptyListz��<���\0\0xpsr\0java.util.LinkedHashMap4�N\\l��\0Z\0accessOrderxq\0~\0?@\0\0\0\0\0w\0\0\0\0\0\0q\0~\0q\0~\0\Zq\0~\0q\0~\0t\0\rclient_secrett\0dubhe-secretq\0~\0q\0~\0q\0~\0q\0~\0 x\0psr\0)org.dubhe.cloud.authconfig.dto.JwtUserDTO\0\0\0\0\0\0\0\0L\0authoritiesq\0~\0L\0usert\0(Lorg/dubhe/biz/base/context/UserContext;xpsq\0~\0\0\0\0.w\0\0\0.sr\0<org.dubhe.cloud.authconfig.service.impl.GrantedAuthorityImpl\0\0\0\0\0\0\0\0L\0	authorityq\0~\0xpt\0ROLE_system:userGroup:deletesq\0~\06t\0ROLE_sq\0~\06t\0ROLE_system:role:editsq\0~\06t\0 ROLE_system:userGroup:deleteUsersq\0~\06t\0ROLE_system:dict:editsq\0~\06t\0ROLE_system:menu:editsq\0~\06t\0ROLE_system:user:deletesq\0~\06t\0ROLE_data:datasetsq\0~\06t\0ROLE_data:createsq\0~\06t\0ROLE_system:user:editsq\0~\06t\0ROLE_system:usersq\0~\06t\0ROLE_管理员sq\0~\06t\0ROLE_system:recyclesq\0~\06t\0ROLE_system:permission:editsq\0~\06t\0ROLE_system:permission:deletesq\0~\06t\0#ROLE_system:userGroup:editUserStatesq\0~\06t\0	ROLE_nullsq\0~\06t\0ROLE_system:dictDetail:deletesq\0~\06t\0ROLE_system:role:deletesq\0~\06t\0ROLE_systemsq\0~\06t\0ROLE_system:rolesq\0~\06t\0ROLE_datasetsq\0~\06t\0ROLE_system:permission:createsq\0~\06t\0ROLE_system:dict:createsq\0~\06t\0ROLE_data:deletesq\0~\06t\0ROLE_system:role:authsq\0~\06t\0ROLE_system:menu:createsq\0~\06t\0ROLE_system:authCode:deletesq\0~\06t\0ROLE_system:userGroup:editUsersq\0~\06t\0ROLE_system:dictsq\0~\06t\0\"ROLE_system:userGroup:editUserRolesq\0~\06t\0ROLE_system:authCodesq\0~\06t\0ROLE_system:dictDetail:createsq\0~\06t\0\ZROLE_system:userGroup:editsq\0~\06t\0ROLE_system:role:menusq\0~\06t\0ROLE_system:dict:deletesq\0~\06t\0ROLE_system:userGroupsq\0~\06t\0ROLE_system:role:createsq\0~\06t\0ROLE_system:menusq\0~\06t\0ROLE_system:userGroup:createsq\0~\06t\0ROLE_system:menu:deletesq\0~\06t\0ROLE_system:user:createsq\0~\06t\0	ROLE_datasq\0~\06t\0ROLE_system:authCode:createsq\0~\06t\0ROLE_system:dictDetail:editsq\0~\06t\0ROLE_system:authCode:editxsr\0&org.dubhe.biz.base.context.UserContext\0\0\0\0\0\0\0\0\nL\0emailq\0~\0L\0enabledt\0Ljava/lang/Boolean;L\0idt\0Ljava/lang/Long;L\0nickNameq\0~\0L\0passwordq\0~\0L\0phoneq\0~\0L\0rolesq\0~\0L\0sexq\0~\0L\0userAvatarPathq\0~\0L\0usernameq\0~\0xpt\0admin@zjlab.comsr\0java.lang.Boolean� r�՜��\0Z\0valuexpsr\0java.lang.Long;��̏#�\0J\0valuexr\0java.lang.Number������\0\0xp\0\0\0\0\0\0\0t\0系统管理员t\0<$2a$10$VhAWNoUtpJKr000UYmfMee4SONBXJuRWGus64bmomyFKEo4kiwHvet\018888888888sq\0~\0\0\0\0w\0\0\0sr\0!org.dubhe.biz.base.dto.SysRoleDTO��\\ꭴ�{\0L\0idq\0~\0�L\0nameq\0~\0L\0permissionsq\0~\0xpq\0~\0�t\0	管理员sq\0~\0\0\0\0Jw\0\0\0Jsr\0\'org.dubhe.biz.base.dto.SysPermissionDTO��\\ꭴ�{\0L\0nameq\0~\0L\0\npermissionq\0~\0L\0roleIdq\0~\0�xpt\0概览pq\0~\0�sq\0~\0�t\0数据管理t\0dataq\0~\0�sq\0~\0�t\0数据集管理t\0data:datasetq\0~\0�sq\0~\0�t\0目标检测详情pq\0~\0�sq\0~\0�t\0目标检测pq\0~\0�sq\0~\0�t\0目标跟踪详情pq\0~\0�sq\0~\0�t\0目标跟踪pq\0~\0�sq\0~\0�t\0数据集版本管理pq\0~\0�sq\0~\0�t\0	控制台t\0systemq\0~\0�sq\0~\0�t\0用户管理t\0system:userq\0~\0�sq\0~\0�t\0角色管理t\0system:roleq\0~\0�sq\0~\0�t\0菜单管理t\0system:menuq\0~\0�sq\0~\0�t\0字典管理t\0system:dictq\0~\0�sq\0~\0�t\0	回收站t\0system:recycleq\0~\0�sq\0~\0�t\0编辑标签组pq\0~\0�sq\0~\0�t\0标签组详情pq\0~\0�sq\0~\0�t\0创建标签组pq\0~\0�sq\0~\0�t\0标签组管理t\0\0q\0~\0�sq\0~\0�t\0图像语义分割详情pq\0~\0�sq\0~\0�t\0图像语义分割pq\0~\0�sq\0~\0�t\0数据集管理pq\0~\0�sq\0~\0�t\0数据集场景选择pq\0~\0�sq\0~\0�t\0文本分类详情q\0~\0�q\0~\0�sq\0~\0�t\0文本标注pq\0~\0�sq\0~\0�t\0导入表格pq\0~\0�sq\0~\0�t\0用户组管理t\0system:userGroupq\0~\0�sq\0~\0�t\0权限管理t\0system:authCodeq\0~\0�sq\0~\0�t\0文本数据集pq\0~\0�sq\0~\0�t\0音频数据集pq\0~\0�sq\0~\0�t\0音频标注pq\0~\0�sq\0~\0�t\0自定义数据集pq\0~\0�sq\0~\0�t\0文本分类pq\0~\0�sq\0~\0�t\0图像分类t\0datasetq\0~\0�sq\0~\0�t\0标注服务管理pq\0~\0�sq\0~\0�t\0	控制台pq\0~\0�sq\0~\0�t\0用户管理pq\0~\0�sq\0~\0�t\0创建用户t\0system:user:createq\0~\0�sq\0~\0�t\0编辑用户t\0system:user:editq\0~\0�sq\0~\0�t\0删除用户t\0system:user:deleteq\0~\0�sq\0~\0�t\0用户组管理pq\0~\0�sq\0~\0�t\0创建用户组t\0system:userGroup:createq\0~\0�sq\0~\0�t\0编辑用户组t\0system:userGroup:editq\0~\0�sq\0~\0�t\0删除用户组t\0system:userGroup:deleteq\0~\0�sq\0~\0�t\0编辑成员t\0system:userGroup:editUserq\0~\0�sq\0~\0�t\0批量修改角色t\0system:userGroup:editUserRoleq\0~\0�sq\0~\0�t\0批量激活锁定t\0system:userGroup:editUserStateq\0~\0�sq\0~\0�t\0批量删除用户t\0system:userGroup:deleteUserq\0~\0�sq\0~\0�t\0权限管理pq\0~\0�sq\0~\0�t\0创建权限组t\0system:authCode:createq\0~\0�sq\0~\0�t\0编辑权限组t\0system:authCode:editq\0~\0�sq\0~\0�t\0删除权限组t\0system:authCode:deleteq\0~\0�sq\0~\0�t\0创建权限t\0system:permission:createq\0~\0�sq\0~\0�t\0编辑权限t\0system:permission:editq\0~\0�sq\0~\0�t\0删除权限t\0system:permission:deleteq\0~\0�sq\0~\0�t\0角色管理pq\0~\0�sq\0~\0�t\0创建角色t\0system:role:createq\0~\0�sq\0~\0�t\0编辑角色t\0system:role:editq\0~\0�sq\0~\0�t\0删除角色t\0system:role:deleteq\0~\0�sq\0~\0�t\0权限分配t\0system:role:authq\0~\0�sq\0~\0�t\0菜单分配t\0system:role:menuq\0~\0�sq\0~\0�t\0菜单管理pq\0~\0�sq\0~\0�t\0删除菜单t\0system:menu:createq\0~\0�sq\0~\0�t\0编辑菜单t\0system:menu:editq\0~\0�sq\0~\0�t\0创建菜单t\0system:menu:deleteq\0~\0�sq\0~\0�t\0字典管理pq\0~\0�sq\0~\0�t\0创建字典t\0system:dict:createq\0~\0�sq\0~\0�t\0编辑字典t\0system:dict:editq\0~\0�sq\0~\0�t\0删除字典t\0system:dict:deleteq\0~\0�sq\0~\0�t\0字典详情-创建t\0system:dictDetail:createq\0~\0�sq\0~\0�t\0字典详情-修改t\0system:dictDetail:editq\0~\0�sq\0~\0�t\0字典详情-删除t\0system:dictDetail:deleteq\0~\0�sq\0~\0�t\0数据管理t\0dataq\0~\0�sq\0~\0�t\0数据集删除t\0data:deleteq\0~\0�sq\0~\0�t\0数据集创建t\0data:createq\0~\0�xxt\0男pt\0admin','757dc566887bdb251c25a194ca51b521');

/*Table structure for table `oauth_client_details` */

DROP TABLE IF EXISTS `oauth_client_details`;

CREATE TABLE `oauth_client_details` (
  `client_id` varchar(256) NOT NULL,
  `resource_ids` varchar(256) DEFAULT NULL,
  `client_secret` varchar(256) DEFAULT NULL,
  `scope` varchar(256) DEFAULT NULL,
  `authorized_grant_types` varchar(256) DEFAULT NULL,
  `web_server_redirect_uri` varchar(256) DEFAULT NULL,
  `authorities` varchar(256) DEFAULT NULL,
  `access_token_validity` int(11) DEFAULT NULL,
  `refresh_token_validity` int(11) DEFAULT NULL,
  `additional_information` varchar(4096) DEFAULT NULL,
  `autoapprove` varchar(256) DEFAULT NULL,
  PRIMARY KEY (`client_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='客户端权限配置表';

/*Data for the table `oauth_client_details` */

insert  into `oauth_client_details`(`client_id`,`resource_ids`,`client_secret`,`scope`,`authorized_grant_types`,`web_server_redirect_uri`,`authorities`,`access_token_validity`,`refresh_token_validity`,`additional_information`,`autoapprove`) values 
('dubhe-client',NULL,'$2a$10$RUYBRsyV2jpG7pvg/VNus.YHVebzfRen3RGeDe1LVEIJeHYe2F1YK','all','authorization_code,password,refresh_token','http://localhost:8866/oauth/callback',NULL,3600,2592000,NULL,NULL);

/*Table structure for table `oauth_refresh_token` */

DROP TABLE IF EXISTS `oauth_refresh_token`;

CREATE TABLE `oauth_refresh_token` (
  `token_id` varchar(256) DEFAULT NULL,
  `token` blob,
  `authentication` blob
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='权限token刷新表';

/*Data for the table `oauth_refresh_token` */

insert  into `oauth_refresh_token`(`token_id`,`token`,`authentication`) values 
('757dc566887bdb251c25a194ca51b521','��\0sr\0Lorg.springframework.security.oauth2.common.DefaultExpiringOAuth2RefreshToken/�Gc��ɷ\0L\0\nexpirationt\0Ljava/util/Date;xr\0Dorg.springframework.security.oauth2.common.DefaultOAuth2RefreshTokens�\ncT�^\0L\0valuet\0Ljava/lang/String;xpt5eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE2ODc1MTAyNzAsInVzZXJfbmFtZSI6ImFkbWluIiwianRpIjoiOTJjNmNkMTQtZTNkZi00NzRmLTg5ZjItZjZkMjliNTZjZGQ0IiwiY2xpZW50X2lkIjoiZHViaGUtY2xpZW50Iiwic2NvcGUiOlsiYWxsIl0sImF0aSI6ImNlNDNjZDViLTIxODEtNDA2OS1iNWYwLTZlNTFiZTdjMjc3YSJ9.uDhVqInTIS35zWu5qAP4pJOdjkjhsDjMET-JqGXCvGYsr\0java.util.Datehj�KYt\0\0xpw\0\0��s@�x','��\0sr\0Aorg.springframework.security.oauth2.provider.OAuth2Authentication�@bR\0L\0\rstoredRequestt\0<Lorg/springframework/security/oauth2/provider/OAuth2Request;L\0userAuthenticationt\02Lorg/springframework/security/core/Authentication;xr\0Gorg.springframework.security.authentication.AbstractAuthenticationTokenӪ(~nGd\0Z\0\rauthenticatedL\0authoritiest\0Ljava/util/Collection;L\0detailst\0Ljava/lang/Object;xp\0sr\0&java.util.Collections$UnmodifiableList�%1��\0L\0listt\0Ljava/util/List;xr\0,java.util.Collections$UnmodifiableCollectionB\0��^�\0L\0cq\0~\0xpsr\0java.util.ArrayListx����a�\0I\0sizexp\0\0\0\0w\0\0\0\0xq\0~\0psr\0:org.springframework.security.oauth2.provider.OAuth2Request\0\0\0\0\0\0\0\0Z\0approvedL\0authoritiesq\0~\0L\0\nextensionst\0Ljava/util/Map;L\0redirectUrit\0Ljava/lang/String;L\0refresht\0;Lorg/springframework/security/oauth2/provider/TokenRequest;L\0resourceIdst\0Ljava/util/Set;L\0\rresponseTypesq\0~\0xr\08org.springframework.security.oauth2.provider.BaseRequest6(z>�qi�\0L\0clientIdq\0~\0L\0requestParametersq\0~\0L\0scopeq\0~\0xpt\0dubhe-clientsr\0%java.util.Collections$UnmodifiableMap��t�B\0L\0mq\0~\0xpsr\0java.util.HashMap���`�\0F\0\nloadFactorI\0	thresholdxp?@\0\0\0\0\0w\0\0\0\0\0\0t\0\ngrant_typet\0passwordt\0	client_idt\0dubhe-clientt\0scopet\0allt\0usernamet\0adminxsr\0%java.util.Collections$UnmodifiableSet��я��U\0\0xq\0~\0	sr\0java.util.LinkedHashSet�l�Z��*\0\0xr\0java.util.HashSet�D�����4\0\0xpw\0\0\0?@\0\0\0\0\0q\0~\0xsq\0~\0$w\0\0\0?@\0\0\0\0\0\0xsq\0~\0?@\0\0\0\0\0\0w\0\0\0\0\0\0\0xppsq\0~\0$w\0\0\0?@\0\0\0\0\0\0xsq\0~\0$w\0\0\0?@\0\0\0\0\0\0xsr\0Oorg.springframework.security.authentication.UsernamePasswordAuthenticationToken\0\0\0\0\0\0\0L\0credentialsq\0~\0L\0	principalq\0~\0xq\0~\0sr\0java.util.Collections$EmptyListz��<���\0\0xpsr\0java.util.LinkedHashMap4�N\\l��\0Z\0accessOrderxq\0~\0?@\0\0\0\0\0w\0\0\0\0\0\0q\0~\0q\0~\0\Zq\0~\0q\0~\0t\0\rclient_secrett\0dubhe-secretq\0~\0q\0~\0q\0~\0q\0~\0 x\0psr\0)org.dubhe.cloud.authconfig.dto.JwtUserDTO\0\0\0\0\0\0\0\0L\0authoritiesq\0~\0L\0usert\0(Lorg/dubhe/biz/base/context/UserContext;xpsq\0~\0\0\0\0.w\0\0\0.sr\0<org.dubhe.cloud.authconfig.service.impl.GrantedAuthorityImpl\0\0\0\0\0\0\0\0L\0	authorityq\0~\0xpt\0ROLE_system:userGroup:deletesq\0~\06t\0ROLE_sq\0~\06t\0ROLE_system:role:editsq\0~\06t\0 ROLE_system:userGroup:deleteUsersq\0~\06t\0ROLE_system:dict:editsq\0~\06t\0ROLE_system:menu:editsq\0~\06t\0ROLE_system:user:deletesq\0~\06t\0ROLE_data:datasetsq\0~\06t\0ROLE_data:createsq\0~\06t\0ROLE_system:user:editsq\0~\06t\0ROLE_system:usersq\0~\06t\0ROLE_管理员sq\0~\06t\0ROLE_system:recyclesq\0~\06t\0ROLE_system:permission:editsq\0~\06t\0ROLE_system:permission:deletesq\0~\06t\0#ROLE_system:userGroup:editUserStatesq\0~\06t\0	ROLE_nullsq\0~\06t\0ROLE_system:dictDetail:deletesq\0~\06t\0ROLE_system:role:deletesq\0~\06t\0ROLE_systemsq\0~\06t\0ROLE_system:rolesq\0~\06t\0ROLE_datasetsq\0~\06t\0ROLE_system:permission:createsq\0~\06t\0ROLE_system:dict:createsq\0~\06t\0ROLE_data:deletesq\0~\06t\0ROLE_system:role:authsq\0~\06t\0ROLE_system:menu:createsq\0~\06t\0ROLE_system:authCode:deletesq\0~\06t\0ROLE_system:userGroup:editUsersq\0~\06t\0ROLE_system:dictsq\0~\06t\0\"ROLE_system:userGroup:editUserRolesq\0~\06t\0ROLE_system:authCodesq\0~\06t\0ROLE_system:dictDetail:createsq\0~\06t\0\ZROLE_system:userGroup:editsq\0~\06t\0ROLE_system:role:menusq\0~\06t\0ROLE_system:dict:deletesq\0~\06t\0ROLE_system:userGroupsq\0~\06t\0ROLE_system:role:createsq\0~\06t\0ROLE_system:menusq\0~\06t\0ROLE_system:userGroup:createsq\0~\06t\0ROLE_system:menu:deletesq\0~\06t\0ROLE_system:user:createsq\0~\06t\0	ROLE_datasq\0~\06t\0ROLE_system:authCode:createsq\0~\06t\0ROLE_system:dictDetail:editsq\0~\06t\0ROLE_system:authCode:editxsr\0&org.dubhe.biz.base.context.UserContext\0\0\0\0\0\0\0\0\nL\0emailq\0~\0L\0enabledt\0Ljava/lang/Boolean;L\0idt\0Ljava/lang/Long;L\0nickNameq\0~\0L\0passwordq\0~\0L\0phoneq\0~\0L\0rolesq\0~\0L\0sexq\0~\0L\0userAvatarPathq\0~\0L\0usernameq\0~\0xpt\0admin@zjlab.comsr\0java.lang.Boolean� r�՜��\0Z\0valuexpsr\0java.lang.Long;��̏#�\0J\0valuexr\0java.lang.Number������\0\0xp\0\0\0\0\0\0\0t\0系统管理员t\0<$2a$10$VhAWNoUtpJKr000UYmfMee4SONBXJuRWGus64bmomyFKEo4kiwHvet\018888888888sq\0~\0\0\0\0w\0\0\0sr\0!org.dubhe.biz.base.dto.SysRoleDTO��\\ꭴ�{\0L\0idq\0~\0�L\0nameq\0~\0L\0permissionsq\0~\0xpq\0~\0�t\0	管理员sq\0~\0\0\0\0Jw\0\0\0Jsr\0\'org.dubhe.biz.base.dto.SysPermissionDTO��\\ꭴ�{\0L\0nameq\0~\0L\0\npermissionq\0~\0L\0roleIdq\0~\0�xpt\0概览pq\0~\0�sq\0~\0�t\0数据管理t\0dataq\0~\0�sq\0~\0�t\0数据集管理t\0data:datasetq\0~\0�sq\0~\0�t\0目标检测详情pq\0~\0�sq\0~\0�t\0目标检测pq\0~\0�sq\0~\0�t\0目标跟踪详情pq\0~\0�sq\0~\0�t\0目标跟踪pq\0~\0�sq\0~\0�t\0数据集版本管理pq\0~\0�sq\0~\0�t\0	控制台t\0systemq\0~\0�sq\0~\0�t\0用户管理t\0system:userq\0~\0�sq\0~\0�t\0角色管理t\0system:roleq\0~\0�sq\0~\0�t\0菜单管理t\0system:menuq\0~\0�sq\0~\0�t\0字典管理t\0system:dictq\0~\0�sq\0~\0�t\0	回收站t\0system:recycleq\0~\0�sq\0~\0�t\0编辑标签组pq\0~\0�sq\0~\0�t\0标签组详情pq\0~\0�sq\0~\0�t\0创建标签组pq\0~\0�sq\0~\0�t\0标签组管理t\0\0q\0~\0�sq\0~\0�t\0图像语义分割详情pq\0~\0�sq\0~\0�t\0图像语义分割pq\0~\0�sq\0~\0�t\0数据集管理pq\0~\0�sq\0~\0�t\0数据集场景选择pq\0~\0�sq\0~\0�t\0文本分类详情q\0~\0�q\0~\0�sq\0~\0�t\0文本标注pq\0~\0�sq\0~\0�t\0导入表格pq\0~\0�sq\0~\0�t\0用户组管理t\0system:userGroupq\0~\0�sq\0~\0�t\0权限管理t\0system:authCodeq\0~\0�sq\0~\0�t\0文本数据集pq\0~\0�sq\0~\0�t\0音频数据集pq\0~\0�sq\0~\0�t\0音频标注pq\0~\0�sq\0~\0�t\0自定义数据集pq\0~\0�sq\0~\0�t\0文本分类pq\0~\0�sq\0~\0�t\0图像分类t\0datasetq\0~\0�sq\0~\0�t\0标注服务管理pq\0~\0�sq\0~\0�t\0	控制台pq\0~\0�sq\0~\0�t\0用户管理pq\0~\0�sq\0~\0�t\0创建用户t\0system:user:createq\0~\0�sq\0~\0�t\0编辑用户t\0system:user:editq\0~\0�sq\0~\0�t\0删除用户t\0system:user:deleteq\0~\0�sq\0~\0�t\0用户组管理pq\0~\0�sq\0~\0�t\0创建用户组t\0system:userGroup:createq\0~\0�sq\0~\0�t\0编辑用户组t\0system:userGroup:editq\0~\0�sq\0~\0�t\0删除用户组t\0system:userGroup:deleteq\0~\0�sq\0~\0�t\0编辑成员t\0system:userGroup:editUserq\0~\0�sq\0~\0�t\0批量修改角色t\0system:userGroup:editUserRoleq\0~\0�sq\0~\0�t\0批量激活锁定t\0system:userGroup:editUserStateq\0~\0�sq\0~\0�t\0批量删除用户t\0system:userGroup:deleteUserq\0~\0�sq\0~\0�t\0权限管理pq\0~\0�sq\0~\0�t\0创建权限组t\0system:authCode:createq\0~\0�sq\0~\0�t\0编辑权限组t\0system:authCode:editq\0~\0�sq\0~\0�t\0删除权限组t\0system:authCode:deleteq\0~\0�sq\0~\0�t\0创建权限t\0system:permission:createq\0~\0�sq\0~\0�t\0编辑权限t\0system:permission:editq\0~\0�sq\0~\0�t\0删除权限t\0system:permission:deleteq\0~\0�sq\0~\0�t\0角色管理pq\0~\0�sq\0~\0�t\0创建角色t\0system:role:createq\0~\0�sq\0~\0�t\0编辑角色t\0system:role:editq\0~\0�sq\0~\0�t\0删除角色t\0system:role:deleteq\0~\0�sq\0~\0�t\0权限分配t\0system:role:authq\0~\0�sq\0~\0�t\0菜单分配t\0system:role:menuq\0~\0�sq\0~\0�t\0菜单管理pq\0~\0�sq\0~\0�t\0删除菜单t\0system:menu:createq\0~\0�sq\0~\0�t\0编辑菜单t\0system:menu:editq\0~\0�sq\0~\0�t\0创建菜单t\0system:menu:deleteq\0~\0�sq\0~\0�t\0字典管理pq\0~\0�sq\0~\0�t\0创建字典t\0system:dict:createq\0~\0�sq\0~\0�t\0编辑字典t\0system:dict:editq\0~\0�sq\0~\0�t\0删除字典t\0system:dict:deleteq\0~\0�sq\0~\0�t\0字典详情-创建t\0system:dictDetail:createq\0~\0�sq\0~\0�t\0字典详情-修改t\0system:dictDetail:editq\0~\0�sq\0~\0�t\0字典详情-删除t\0system:dictDetail:deleteq\0~\0�sq\0~\0�t\0数据管理t\0dataq\0~\0�sq\0~\0�t\0数据集删除t\0data:deleteq\0~\0�sq\0~\0�t\0数据集创建t\0data:createq\0~\0�xxt\0男pt\0admin');

/*Table structure for table `permission` */

DROP TABLE IF EXISTS `permission`;

CREATE TABLE `permission` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `pid` bigint(20) NOT NULL DEFAULT '0' COMMENT '父id',
  `name` varchar(64) DEFAULT NULL COMMENT '菜单/操作按钮名称',
  `permission` varchar(128) DEFAULT NULL COMMENT '权限标识',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人id',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) DEFAULT b'0' COMMENT '删除标记 0正常，1已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=112 DEFAULT CHARSET=utf8 COMMENT='权限表';

/*Data for the table `permission` */

insert  into `permission`(`id`,`pid`,`name`,`permission`,`create_user_id`,`update_user_id`,`create_time`,`update_time`,`deleted`) values 
(5,0,'控制台',NULL,1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(6,5,'用户管理',NULL,1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(7,6,'创建用户','system:user:create',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(8,6,'编辑用户','system:user:edit',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(9,6,'删除用户','system:user:delete',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(10,5,'用户组管理',NULL,1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(11,10,'创建用户组','system:userGroup:create',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(12,10,'编辑用户组','system:userGroup:edit',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(13,10,'删除用户组','system:userGroup:delete',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(14,10,'编辑成员','system:userGroup:editUser',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(15,10,'批量修改角色','system:userGroup:editUserRole',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(16,10,'批量激活锁定','system:userGroup:editUserState',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(17,10,'批量删除用户','system:userGroup:deleteUser',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(18,5,'权限管理',NULL,1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(19,18,'创建权限组','system:authCode:create',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(20,18,'编辑权限组','system:authCode:edit',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(21,18,'删除权限组','system:authCode:delete',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(22,18,'创建权限','system:permission:create',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(23,18,'编辑权限','system:permission:edit',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(24,18,'删除权限','system:permission:delete',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(25,5,'角色管理',NULL,1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(26,25,'创建角色','system:role:create',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(27,25,'编辑角色','system:role:edit',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(28,25,'删除角色','system:role:delete',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(29,25,'权限分配','system:role:auth',1,1,'2023-04-14 15:46:17','2023-04-14 15:46:17','\0'),
(30,25,'菜单分配','system:role:menu',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(31,5,'菜单管理',NULL,1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(32,31,'删除菜单','system:menu:create',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(33,31,'编辑菜单','system:menu:edit',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(34,31,'创建菜单','system:menu:delete',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(35,5,'字典管理',NULL,1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(36,35,'创建字典','system:dict:create',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(37,35,'编辑字典','system:dict:edit',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(38,35,'删除字典','system:dict:delete',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(39,35,'字典详情-创建','system:dictDetail:create',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(40,35,'字典详情-修改','system:dictDetail:edit',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(41,35,'字典详情-删除','system:dictDetail:delete',1,1,'2023-04-14 15:46:18','2023-04-14 15:46:18','\0'),
(103,6,'编辑用户配置','system:user:configEdit',1,1,'2023-04-14 15:49:09','2023-04-14 15:49:09','\0'),
(104,6,'查询用户资源信息','system:user:resourceInfo',1,1,'2023-04-14 15:49:10','2023-04-14 15:49:10','\0'),
(106,0,'数据管理','data',1,1,'2023-04-23 16:59:52','2023-05-17 10:37:28','\0'),
(107,106,'数据集','',1,1,'2023-04-23 17:00:30','2023-05-17 10:15:22','\0'),
(108,107,'数据集删除','data:datasets:delete',1,1,'2023-04-23 17:02:57','2023-05-17 10:15:22','\0'),
(109,107,'数据集查看',NULL,1,1,'2023-04-23 17:05:53','2023-05-17 10:15:22','\0'),
(110,106,'数据集删除','data:delete',1,1,'2023-04-26 10:27:22','2023-04-26 10:27:22','\0'),
(111,106,'数据集创建','data:create',1,1,'2023-04-26 10:29:07','2023-04-26 10:29:07','\0');

/*Table structure for table `pt_group` */

DROP TABLE IF EXISTS `pt_group`;

CREATE TABLE `pt_group` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) DEFAULT NULL COMMENT '用户组名称',
  `description` varchar(255) DEFAULT NULL COMMENT '备注',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人id',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` bit(1) DEFAULT b'0' COMMENT '删除标记 0正常，1已删除',
  PRIMARY KEY (`id`),
  UNIQUE KEY `group_name_uindex` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='用户组表';

/*Data for the table `pt_group` */

insert  into `pt_group`(`id`,`name`,`description`,`create_user_id`,`update_user_id`,`create_time`,`update_time`,`deleted`) values 
(1,'数据标注1组','数据标注1组',1,1,'2023-05-16 16:43:44','2023-05-16 16:54:24','\0');

/*Table structure for table `recycle` */

DROP TABLE IF EXISTS `recycle`;

CREATE TABLE `recycle` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `recycle_module` varchar(32) NOT NULL COMMENT '回收模块',
  `recycle_delay_date` datetime DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '回收日期',
  `recycle_custom` varchar(64) DEFAULT NULL COMMENT '回收定制化方式',
  `recycle_status` tinyint(4) DEFAULT '0' COMMENT '回收任务状态(0:待删除，1:已删除，2:删除失败，3：删除中，4：还原中，5：已还原)',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人ID',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  `recycle_note` varchar(512) DEFAULT NULL COMMENT '回收说明',
  `remark` varchar(512) DEFAULT NULL COMMENT '备注',
  `recycle_response` varchar(512) DEFAULT NULL COMMENT '回收响应信息',
  `restore_custom` varchar(64) DEFAULT NULL COMMENT '还原定制化方式',
  `deleted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '删除(0正常，1已删除)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COMMENT='垃圾回收任务主表';

/*Data for the table `recycle` */

/*Table structure for table `recycle_detail` */

DROP TABLE IF EXISTS `recycle_detail`;

CREATE TABLE `recycle_detail` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `recycle_id` bigint(20) NOT NULL COMMENT '垃圾回收任务主表ID',
  `recycle_type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '回收类型(0文件，1数据库表数据)',
  `recycle_condition` text NOT NULL COMMENT '回收条件(回收表数据sql、回收文件绝对路径)',
  `recycle_status` tinyint(4) DEFAULT '0' COMMENT '回收任务状态(0:待删除，1:已删除，2:删除失败，3：删除中)',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人ID',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  `recycle_note` varchar(512) DEFAULT NULL COMMENT '回收说明',
  `remark` varchar(512) DEFAULT NULL COMMENT '备注',
  `recycle_response` varchar(512) DEFAULT NULL COMMENT '回收响应信息',
  `deleted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '删除(0正常，1已删除)',
  PRIMARY KEY (`id`),
  KEY `recycle_task_main_id` (`recycle_id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8mb4 COMMENT='垃圾回收任务详情表';

/*Data for the table `recycle_detail` */

/*Table structure for table `recycle_task` */

DROP TABLE IF EXISTS `recycle_task`;

CREATE TABLE `recycle_task` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `recycle_module` varchar(32) NOT NULL COMMENT '回收模块',
  `recycle_type` tinyint(1) NOT NULL DEFAULT '0' COMMENT '回收类型(0文件，1数据库表数据)',
  `recycle_custom` varchar(64) DEFAULT NULL COMMENT '回收定制化方式',
  `recycle_condition` text NOT NULL COMMENT '回收条件(回收表数据sql、回收文件绝对路径)',
  `recycle_delay_date` date DEFAULT NULL COMMENT '回收日期',
  `recycle_status` tinyint(4) DEFAULT '0' COMMENT '回收任务状态(0:待删除，1:已删除，2:删除失败，3：删除中，4：还原中，5：已还原)',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人ID',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '修改时间',
  `recycle_note` varchar(512) DEFAULT NULL COMMENT '回收说明',
  `remark` varchar(512) DEFAULT NULL COMMENT '备注',
  `recycle_response` varchar(512) DEFAULT NULL COMMENT '回收响应信息',
  `restore_custom` varchar(64) DEFAULT NULL COMMENT '还原定制化方式',
  `deleted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '删除(0正常，1已删除)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='垃圾回收任务表';

/*Data for the table `recycle_task` */

/*Table structure for table `role` */

DROP TABLE IF EXISTS `role`;

CREATE TABLE `role` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `permission` varchar(255) DEFAULT NULL,
  `remark` varchar(255) DEFAULT NULL,
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人id',
  `deleted` bit(1) DEFAULT b'0' COMMENT '删除标记 0正常，1已删除',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `role` */

insert  into `role`(`id`,`name`,`permission`,`remark`,`create_user_id`,`update_user_id`,`deleted`,`create_time`,`update_time`) values 
(1,'管理员','admin',NULL,NULL,NULL,'\0','2023-04-14 15:44:51','2023-04-14 15:44:51'),
(2,'注册用户','register',NULL,NULL,NULL,'\0','2023-04-14 15:44:51','2023-04-14 15:44:51');

/*Table structure for table `roles_auth` */

DROP TABLE IF EXISTS `roles_auth`;

CREATE TABLE `roles_auth` (
  `role_id` bigint(20) NOT NULL,
  `auth_id` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='角色权限关联表';

/*Data for the table `roles_auth` */

insert  into `roles_auth`(`role_id`,`auth_id`) values 
(1,1),
(2,2);

/*Table structure for table `roles_menus` */

DROP TABLE IF EXISTS `roles_menus`;

CREATE TABLE `roles_menus` (
  `role_id` bigint(20) NOT NULL,
  `menu_id` bigint(20) NOT NULL,
  PRIMARY KEY (`role_id`,`menu_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `roles_menus` */

insert  into `roles_menus`(`role_id`,`menu_id`) values 
(1,1),
(1,10),
(1,11),
(1,13),
(1,14),
(1,15),
(1,16),
(1,17),
(1,90),
(1,91),
(1,92),
(1,93),
(1,94),
(1,96),
(1,100),
(1,101),
(1,102),
(1,103),
(1,1067),
(1,1068),
(1,1070),
(1,1072),
(1,1073),
(1,1074),
(1,1075),
(1,1076),
(1,1077),
(1,1078),
(1,1079),
(1,1080),
(1,1081),
(1,1095),
(1,1096),
(1,1100),
(2,1),
(2,10),
(2,11),
(2,13),
(2,14),
(2,15),
(2,16),
(2,17),
(2,100),
(2,101),
(2,102),
(2,103),
(2,1067),
(2,1068),
(2,1070),
(2,1072),
(2,1073),
(2,1074),
(2,1075),
(2,1078),
(2,1079),
(2,1080),
(2,1081),
(2,1095),
(2,1096),
(2,1100);

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `email` varchar(255) DEFAULT NULL,
  `enabled` bit(1) NOT NULL,
  `last_password_reset_time` datetime DEFAULT NULL,
  `nick_name` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `sex` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `remark` varchar(255) DEFAULT NULL,
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人id',
  `deleted` bit(1) DEFAULT b'0' COMMENT '删除标记 0正常，1已删除',
  `avatar_id` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `user` */

insert  into `user`(`id`,`email`,`enabled`,`last_password_reset_time`,`nick_name`,`password`,`phone`,`sex`,`username`,`remark`,`create_time`,`update_time`,`create_user_id`,`update_user_id`,`deleted`,`avatar_id`) values 
(1,'admin@zjlab.com','',NULL,'系统管理员','$2a$10$VhAWNoUtpJKr000UYmfMee4SONBXJuRWGus64bmomyFKEo4kiwHve','18888888888','男','admin','管理员账号','2023-04-14 15:44:51','2023-04-20 14:49:53',0,0,'\0',NULL),
(2,'yzc@zjlab.com','',NULL,'demo','$2a$10$B2XvwJwZ20fKlkNxR3Sy4O/kcPtPzDwWk0AfuiNF2m4A5GIkg1ZNK','18069945688','男','demo','演示账号','2023-04-18 16:39:42','2023-05-16 17:06:12',1,1,'\0',NULL);

/*Table structure for table `user_avatar` */

DROP TABLE IF EXISTS `user_avatar`;

CREATE TABLE `user_avatar` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `path` varchar(255) DEFAULT NULL,
  `real_name` varchar(255) DEFAULT NULL,
  `size` varchar(255) DEFAULT NULL,
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建人id',
  `update_user_id` bigint(20) DEFAULT NULL COMMENT '修改人id',
  `deleted` bit(1) DEFAULT b'0' COMMENT '删除标记 0正常，1已删除',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `user_avatar` */

/*Table structure for table `user_group` */

DROP TABLE IF EXISTS `user_group`;

CREATE TABLE `user_group` (
  `group_id` bigint(20) NOT NULL COMMENT '用户组id',
  `user_id` bigint(20) NOT NULL COMMENT '用户id',
  UNIQUE KEY `group_user_user_id` (`user_id`),
  KEY `group_user_group_id` (`group_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户组-用户关联表';

/*Data for the table `user_group` */

insert  into `user_group`(`group_id`,`user_id`) values 
(1,1);

/*Table structure for table `users_roles` */

DROP TABLE IF EXISTS `users_roles`;

CREATE TABLE `users_roles` (
  `user_id` bigint(20) NOT NULL COMMENT '用户ID',
  `role_id` bigint(20) NOT NULL COMMENT '角色ID',
  PRIMARY KEY (`user_id`,`role_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户角色关联';

/*Data for the table `users_roles` */

insert  into `users_roles`(`user_id`,`role_id`) values 
(1,1),
(2,2);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
